export default {
  hello: 'asd',
  title: {
    home: 'Начална страница',
    page: 'страница',
    guest: 'Вход',
    lists: { 0: 'Списъци' },
    tags: {
      0: 'Ключови Думи',
      1: '{amount} ключови думи  за категория {name}'
    },
    ideas: {
      0: 'Вдъхновение',
      1: '«{amount}»'
    },
    sounds: { 0: 'Звуци' },
    leaderboard: { 0: 'Класации' },
    extend: { 0: 'Повече | По-малко' },
    skin: {
      0: 'Този облик съдържа елементи от други облици',
      1: 'Кликни тук за повече информация'
    }
  },
  changelogs: {
    0: 'Списък с промени',
    1: 'Списък на всички ревизии, направени в текущата версия',
    2: 'Няма нищо тук',
    3: 'Но можете да добавите промени, които сте направили към тази версия на облика',
    4: 'Без група',
    5: 'Ново',
    6: 'Поправено',
    7: 'Променено',
    8: 'Премахнато'
  },
  creators: {
    0: 'Създатели',
    1: 'Сисък с всички създатели, които са подпомогнали с направата на този облик',
    2: 'Няма никой тук',
    3: 'Въвеждането на име на играч ще ви покаже резултатите от osu търсенето.',
    4: 'Редактор',
    5: 'Роли',
    6: 'Версии'
  },
  tags: {
    0: 'Ключови Думи',
    1: 'Списък с всички ключови думи свързани с този облик',
    2: 'Изглежда доста празно тук.',
    3: 'Използвайте полето горе, за да намерите нови ключови думи.'
  },
  videos: {
    0: 'Видеа',
    1: 'Списък с всички видеа показващи този облик.',
    2: 'Нула показвания на този облик',
    3: 'Потърсете някои в YouTube или създайте свои.'
  },
  sources: {
    0: 'Атрибуция',
    1: 'Списък с всички използвани ресурси или инструменти във видеото на облика',
    2: 'Доста празно тук',
    3: 'Ако сте използвали ресурси или някакъв вид изображения от други облици, моля добавете ги в кутията отгоре',
    4: 'Без група'
  },
  checks: {
    0: 'Всички',
    1: 'Метаданни',
    2: 'Отличителни черти',
    4: 'Добавете поне един съдател на облика',
    5: 'Добавете няколко ключови думи',
    6: 'Тежестта на облика не е специфицирана',
    7: 'Изберете поне един режим на игра',
    8: 'Изберете вид на файла (SD или HD)',
    9: 'Изберете поне едно съотношение на резолюцията',
    10: 'Няма екранни снимки',
    11: 'Добавете поне една екранна снимка по време на игра',
    12: 'Връзка за облика не е специфициран',
    20: 'Доста добре изглежда',
    21: 'Всяка една грешка е оправена, което е доста добре',
    22: 'Списък за проверка'
  },
  skins: {
    0: 'Облици',
    1: 'Популярни',
    2: 'std | ctb',
    3: 'mania | taiko',
    4: 'Скорошни',
    5: 'Случайни',
    6: 'Всички облици',
    7: 'Съотношение на резолюцията',
    8: 'Вскички облици | osu облици',
    9: 'Облик | Облици | Облици',
    10: 'osu облици от {name} | Всички облици от',
    11: 'Търсене'
  },
  skin: {
    0: 'Редактиран',
    1: 'Екстра',
    2: 'HD',
    3: 'FullHD',
    4: 'Анимация',
    5: 'Екранни снимки',
    6: 'Само в игра',
    7: 'Връзка към изтегляне | Изтегли облик',
    8: 'Форум пост |osu! форум',
    9: 'Reddit пост',
    10: 'Създатели',
    11: 'Ключови Думи',
    13: 'Видеа',
    14: 'Нови версии | Управлявай версиите',
    15: 'Обнови | Предай',
    16: 'Игрови режими',
    17: 'Име на облика',
    18: 'Версия | Версии',
    19: 'Големина',
    20: 'Метаданни',
    21: 'Рейтинг',
    22: 'Изгеляния',
    23: 'Връзка към изтегляне ще бъде съдадена скоро',
    24: '{amount} оставаци секунди',
    25: 'Ти не си един от нас',
    26: 'Изглежда че ти не си един от създателите или редакторите на този облик'
  },
  drag: {
    0: 'Кликни тук',
    1: 'или влачете и пуснете изображения'
  },
  footer: {
    0: 'Направено от cyperdark',
    1: 'Кредити'
  },
  credits: {
    0: 'Chibi',
    1: 'Изображения',
    2: 'Икони',
    3: 'Всичи икони са взети от {name}',
    4: 'Знамена',
    5: 'Всички изображения на знамена са взети от {name}'
  },
  search: {
    0: 'Търсене на облик',
    1: 'Гледания',
    2: 'Заглавие',
    3: 'Рейтинг',
    4: 'Големина',
    5: 'Дата',
    7: 'Нищо не е намерено',
    8: 'Опитайте се да сложите друга критерия за търсене',
    9: 'Чакане на заявка',
    10: 'Изберете критерия за търсене или просто напишете заглавието на облика, на създателя, или просто ключовите думи'
  },
  tabs: {
    0: 'Търсене',
    1: 'Редактиран',
    2: 'Списък'
  },
  undefined: {
    0: 'Празно',
    1: 'За съжаление няма нищо тук, но може да погледнете други сраници.',
    2: 'За съжаление няма нищо тук',
    3: 'Неразрешено',
    4: 'Трябва да сте влезли за да редактирате този облик.',
    5: 'Трябва да сте влезли за да добавите нов облик.'
  },
  meta: {
    title: {
      0: 'Начална страница',
      1: 'Игрови режими, съотношение на резолюцията osu облици',
      2: 'Популярни osu облици',
      3: 'Търсете osu облици',
      4: '«{name}» Списък с ключови думи',
      5: '{name} v{version} osu облик',
      6: 'Кредити',
      7: 'osu облици',
      8: '{name} трърси osu облици',
      9: 'Вдъхнови се от дръги osu облици',
      10: '{name} създадени osu облици'
    },
    description: {
      // 0: 'Get the best osu skins at our site, with a huge library to choose from! We have skins for different gamemodes and aspect ratios, and even feature top players and anime themes. Boost your gameplay with our high-quality skins.',
      0: 'Намерете най-добрите osu! облици на нашия сайт! Нашия огромен каталог е изпълнен с облици за всички игрови режими, съотношение на резолюцията и дори най-добрите играчи. И още, имаме специална секция за anime феновете. Подобри всоята игра с префектния osu облик за теб. #osuskins #osugame #anime',
      1: '{views} гледания. osu облика за {modes}, неговата тежест е {size}, създаден от {creators}. Поддържа {ratios}',
      2: 'Намерете перфектния osu! облик с нашата модерна търсачка. Разгледайте нашата огромна колкция от облици, филтрирани по игрови режим, съотношение на резолюцията, и още. Или, разгледайте облици използвани от топ играчи',
      3: 'Открийте разнообразие от облици за различни режими на игра и съотношение на резолючия на нашия сайт. Изберете от osu!std, ctb, mania и taiko режими. Намерете идеалното решение за вашите предпочитания за игри.',
      4: 'Намерете перфектния osu облик от топ играчите на нашия сайт. Разгледайте нашата колекция от популярни облици и персонализирайте вашата игра. Открийте широк обхват от стилове и теми, които отговарят на вашите предпочитания.',
      5: 'Списък със съществуващи ключови думи за osu облици.',
      6: '{name} osu колкция с облици!, безплатно изтегляне',
      7: 'Огромен брой osu облици за {name}, изтеглете безплатно!',
      8: 'Всички osu облици създадени от {name}',
      9: 'Намерете вдъхновение за вашите osu! облици на нашия.Открийте нови техники и идеи с помощта на нашата голяма колекция на osu облици. Вдъхновете се и създайте вашия собствен osu облик.'
    },
    keywords: { 0: 'osu, osu!, osu skins, std skins, ctb skins, mania skins, taiko skins, mrekk osu skins,Rafis osu skins,FlyingTuna osu skins,Vaxei osu skins,Cookiezi osu skins,Varvalian osu skins,RyuK osu skins,WhiteCat osu skins,_RyuK osu skins,BeasttrollMC osu skins,Genshin Impact osu skins,Mathi osu skins,WubWoofWolf osu skins,Merami osu skins,xootynator osu skins,Gayzmcgee osu skins,[Karcher] osu skins,Bubbleman osu skins,ChomikBox osu skins,NSFW osu skins,Lifeline osu skins,Hatsune Miku osu skins,Azerite osu skins,Umbre osu skins,404 AimNotFound osu skins,-Nikstrim osu skins,bloo osu skins,Shigetora osu skins,Badeu osu skins,FunOrange osu skins,worst hr player osu skins,Tekkito osu skins,ninerik osu skins,azr8 osu skins,idke osu skins,Andros osu skins,Zylice osu skins,Rektygon osu skins,Komori osu skins,anime osu skins,cyperdark osu skins,Red_Pixel osu skins,Utami osu skins,Arknights osu skins,Karthy osu skins,Paraqeet osu skins,aetrna osu skins,Spare osu skins,-GN osu skins,Mastasz osu skins,Seouless osu skins,haga1115 osu skins,shimon osu skins,fieryrage osu skins,Ekoro osu skins,Firebat92 osu skins,_Shield osu skins,-Roaz- osu skins,- Dark - osu skins,atturbo555 osu skins,Aristia osu skins,_Aiko__ osu skins,z x c osu skins,eternum osu skins,talala osu skins,NyanPotato osu skins,Arnold24x24 osu skins,Alumetri osu skins,im a fancy lad osu skins,jordanlr7 osu skins,Woey osu skins,khz osu skins,rrtyui osu skins,kieg osu skins,Rupertion osu skins,FGSky osu skins,Aireu osu skins,Neko God osu skins,Apostol osu skins,Abyssal osu skins,dokidokilolixx osu skins,Mlaw osu skins,Ponytail osu skins,Reedkatt osu skins,Zestiny osu skins,Apraxia osu skins,Binfy osu skins,Rohulk osu skins,-PloX osu skins,DuyKhang-sama osu skins,BronyPH osu skins,Intercambing osu skins,Xeltol osu skins,Valorant osu skins,Akolibed osu skins,hololive osu skins,kablaze osu skins,tokyo ghoul osu skins,Trail Mix osu skins,Dereban osu skins' }
  },
  buttons: {
    0: 'Login',
    1: 'Начална страница',
    profile_osu: 'osu! Профил',
    new_skin: 'Нов облик',
    notifications: 'Нотификации',
    settings: 'Настройки',
    logout: 'Изход',
    load_more: 'Заредете повече',
    copy_short: 'Копиране на кратка връзка',
    copied: 'Копирано',
    reddit_link: 'Reddit',
    osu_forum_link: 'osu! Форум',
    skin_return: 'Обратно към облик'
  },
  user: {
    roles: {
      0: 'създател',
      1: 'Миксър',
      2: 'Анимации',
      3: 'Изображения',
      4: 'Колаборации'
    }
  },
  tooltips: {
    0: '{amount} гледания',
    1: 'Обнови резултатите',
    2: 'Низходящ | Възходящ',
    3: '{amount} харесвания',
    4: 'Натиснете ctrl+enter за да добавите ключови думи',
    5: 'Редакрирайте версията',
    6: '{s}Вход{p}, за да можете да оцените облика',
    7: 'Няма кратко описание',
    8: 'Няма връзка'
  },
  lists: {
    screens: {
      0: 'Добре дошли',
      1: 'Главно меню',
      2: 'Избор на песен',
      3: 'Меню на режим',
      4: 'Модове',
      5: 'Обратно броене',
      6: 'Игра',
      7: 'Спинър',
      8: 'Мината секция',
      9: 'провалена секция',
      10: 'Екран за прауза',
      11: 'Екран за провал',
      12: 'Екран за резултат',
      13: 'Пропускане',
      14: 'Банер'
    },
    cats: {
      0: 'Не е безопасно за работа',
      1: 'Фъри',
      2: 'Миксирано'
    }
  },
  select: {
    0: 'Ново',
    1: 'Поправено',
    2: 'Променено',
    3: 'Отстранено',
    4: 'Изкуство',
    5: 'Шрифт',
    6: 'Артисти',
    7: 'елемент на облик',
    8: 'Звук/Звукови ефекти',
    9: 'Инструменти',
    views: 'Гледания',
    likes: 'Харесвания',
    size_range: 'Изберете големина',
    date_range: 'Изберете времева рамка',
    ratio: 'Изберете съотношение на резолюцията | съотношение на резолюцията'
  },
  placeholders: {
    0: 'Изберете роли',
    1: 'Изберете версии',
    2: 'Напишете текст...',
    3: 'Изберете големина',
    4: 'Изберете времева рамка',
    5: 'Година',
    6: 'Месец',
    7: 'Изберете съотношение на резолюцията',
    8: 'Изберете категории',
    9: 'Игрови режими',
    10: 'Изберете вид',
    11: 'Поставете YouTube връзка',
    12: 'Напичете описание и връзка. Описание на формарта:връзка',
    13: 'Изберете екстра',
    14: 'Поставете връзка',
    15: 'Заглавие на облика, създател, или ключова дума'
  }
};