export default {
  header: {
    home: 'ホーム',
    contests: 'コンテスト',
    ideas: 'インスピレーション',
    tools: 'ツール',
    popular: '人気のスキン',
    all_skins: 'すべてのスキン',
    tags: 'タグ',
    new: '新着',
    contribute: '投稿する',
    login: 'ログイン',
    0: '閲覧数',
    1: 'ダウンロード数',
    2: 'いいね'
  },
  notifications: {
    0: '通知',
    1: '新しいスキンの通知を受け取るには、こちらのプラットフォームでフォローしてください。'
  },
  user_menu: {
    0: 'プロフィール',
    1: '自分のスキン一覧',
    2: '再ログイン',
    3: 'ログアウト'
  },
  status: {
    0: '何も見つかりませんでした',
    1: '見つかりません',
    2: `画像を読み込めませんでした`,
    3: '読み込む画像がありません'
  },
  settings: {
    0: '設定',
    1: 'マウススクロール',
    2: 'スキンブロックにカーソルを合わせたとき、画像を簡単に切り替えられるようにします。',
    3: '拡大',
    4: 'スキンブロックにカーソルを合わせた際、自動で画像を拡大します。'
  },
  footer: {
    0: 'クレジット',
    1: '問題を報告'
  },
  home: {
    title: [
      'osu! のスキンを見つける',
      'ランダム osu! スキン'
    ],
    description: '私たちのサイトで最高の osu! スキンを見つけましょう！\n膨大なライブラリには、トッププレイヤーが使用するスタイルも含まれています。\nさらに、あなたのプレイスタイルにぴったり合うスキンを探す特別なセクションも用意しています。\n#osuskins #osugame',
    0: 'ダウンロード可能',
    1: '最も [viewed] [liked] [downloaded] スキン',
    2: [
      '閲覧',
      'いいね',
      'ダウンロード'
    ],
    3: [
      '最近',
      '新着リリース',
      'ランダム'
    ],
    4: 'アスペクト比',
    5: 'もっと見る',
    6: 'Recently uploaded/updated skins',
    7: 'Newly released skins'
  },
  credits: {
    title: [
      'アートワーク提供者',
      '使用アセット',
      'ローカライズ協力者'
    ],
    0: 'クレジット',
    1: '誰か？ [{lang}]',
    2: 'cyperdark が追加し忘れたようです。{text}',
    3: [
      'アートワーク',
      'ローカライズ',
      'アセット'
    ],
    4: 'すべてのアイコンは{name}から使用しています',
    5: '国旗画像はすべて {name} のものです'
  },
  tools: {
    title: 'osu! 用スキニングツール（自作ツールです :) ）',
    description: 'cyperdark が作った、osu! のスキニングに便利なツール集です',
    0: 'ほかのスキニングツールを見る'
  },
  skin_ini: {
    title: 'ビジュアル skin.ini エディター - osu! ツール',
    description: '',
    prepare: [
      'ビートマップを読み込み中',
      'スキンを読み込み中',
      'スキンを準備中',
      'ビューワーを読み込み中'
    ],
    0: 'ビジュアル skin.ini エディターへようこそ！',
    1: 'ここではコンボカラーやスライダーカラー、フォント位置などの変更を、標準モードのゲームプレイ画面でリアルタイムに確認できます。',
    2: 'ビートマップ：',
    3: 'ビートマップのリンクを貼り付け',
    4: '.osk / .zip をインポート',
    5: 'スキンフォルダーをインポート',
    6: '.osu ファイルが見つかりません',
    7: '対応していないゲームモードです。osu モードのビートマップのみ使用できます',
    8: 'skin.ini が見つかりません',
    9: '少なくとも 1 つの .osk / .zip ファイルを選択してください',
    10: 'ビューワー設定',
    11: 'skin.ini をリセット',
    12: 'skin.ini をエクスポート',
    13: '色をランダムに変更（現在のタブ）',
    14: 'タブを切り替え',
    15: '巻き戻し',
    16: '早送り',
    17: 'ビューワーを再生 / 一時停止',
    18: '前の設定セクションへ移動',
    19: '次の設定セクションへ移動',
    20: 'メニューを開く',
    21: 'メニューを閉じる',
    22: 'ショートカット',
    23: '説明',
    24: 'カンマ区切りで指定',
    25: 'ランダム',
    26: '要素をデフォルトに戻す',
    27: 'デフォルトにリセット',
    28: 'ファイルを差し替え',
    29: '問題',
    30: 'ファイルまたはスキンをドラッグ＆ドロップ',
    31: '読み込み完了',
    32: 'ゲームプレイ速度',
    33: 'ランダムビートマップ',
    34: 'ビートマップフォルダー'
  },
  contests: {
    title: '公式 osu! スキンコンテスト',
    description: '開催中・終了済みの osu! コンテスト一覧です',
    submit: [
      '応募は締め切りました…',
      '応募受付中…',
      '作品を投稿'
    ],
    0: '公式スキンコンテスト',
    1: [
      '応募',
      '準備中',
      '投票中',
      '終了'
    ],
    2: 'お知らせ',
    3: '応募期間は終了しました',
    4: '投票が始まりました',
    5: '投票が終了しました',
    6: '結果が公開されました',
    7: '応募受付中…',
    8: '準備中…',
    9: '投票受付中…',
    10: '結果待ち…',
    11: 'ここから投票',
    12: 'お知らせ',
    13: '応募一覧',
    14: 'コンテストページ',
    15: '結果',
    16: 'wiki',
    17: '終了まで残り',
    18: 'このコンテストのスキンは見つかりませんでした',
    19: '説明を表示 | 説明を閉じる'
  },
  ideas: {
    title: 'インスピレーション - osu! スキン',
    description: '次の osu! スキン作りのヒントをここで見つけよう。いろいろなスキンを見て、新しい表現やアイデアを吸収して、自分だけのスキンを作ってみてください。',
    0: 'このカテゴリのスクリーンショットは見つかりませんでした'
  },
  search: {
    title: 'osu スキンを検索',
    description: '高度な検索機能で、自分に合った osu! スキンを探しましょう。ルールセットやアスペクト比などで絞り込んだり、トッププレイヤーが使っているスキンをチェックしたりできます。',
    0: 'スキン名・作者名・タグ',
    1: [
      '名前',
      'タグ',
      '制作者'
    ],
    2: '日付範囲を選択',
    3: 'サイズの範囲',
    4: '閲覧数の範囲',
    5: 'ダウンロード数の範囲',
    6: 'いいね数の範囲',
    7: 'カーソルタイプを選択',
    8: '何も見つかりませんでした',
    9: '検索条件を変えて試してみてください',
    10: '検索を保留中です',
    11: '検索フィルターを使うか、スキンのタイトル・作者名・タグを入力してください',
    12: 'mania のキー数を選択',
    13: 'リセット',
    14: 'カーソルカラー',
    15: 'サークルカラー',
    16: 'スライダーボーダーの色',
    17: 'スライダートラックの色',
    18: '実験的なフィルター'
  },
  tags: {
    title: 'タグを検索',
    description: '',
    0: '何も見つかりませんでした',
    1: '別のキーワードで検索してみてください'
  },
  tag: {
    title: '{name} の osu スキン',
    description: '',
    0: '何も見つかりませんでした',
    1: 'このタグのスキンは見つかりませんでした',
    2: 'ゲームモードを変えて試してみてください',
    3: 'missing skin'
  },
  users: {
    title: [
      'プロフィール - {name} のアップロード',
      'プロフィール - {name} のスキン'
    ],
    description: [
      '{name} がアップロードした osu! スキン一覧',
      '{name} が作成した osu! スキン一覧'
    ],
    0: [
      '作成したスキン',
      'アップロードしたスキン'
    ],
    1: 'URL が正しくありません',
    2: 'リンクが正しいか確認してください。例：{url}',
    3: 'この形式には対応していません',
    4: 'リンクの形式が違います。{url} または {url_1} を使ってください',
    5: `設定を更新する前に、少なくとも1つは項目を変更してください`,
    6: `設定を更新できません`,
    7: `設定を更新しました`,
    8: '原因不明のエラーが発生しました',
    9: '設定',
    10: 'Discord のユーザー名',
    11: 'Discord サーバーのリンク',
    12: 'Twitter プロフィールリンク',
    13: 'Reddit プロフィールリンク',
    14: 'YouTube チャンネルリンク',
    15: 'ブログへのリンク',
    16: '自分がいいねしたスキンを公開する',
    17: '設定を保存',
    18: '{amount} 件アップロード | {amount} 件アップロード | {amount} 件アップロード',
    19: 'ブログ',
    20: 'スキン統計',
    21: '「自己紹介」を開く | 「自己紹介」を閉じる',
    22: '何も見つかりませんでした',
    23: 'この制作者のスキンは見つかりませんでした'
  },
  skins: {
    title: [
      'osu! スキン {amount} 件',
      '{category} osu! スキン {amount} 件',
      'ユニバーサルアスペクト比 osu! スキン {amount} 件',
      '閲覧数トップ {mode} スキン 204 件',
      'ダウンロード数トップ {mode} スキン 204 件',
      'いいね数トップ {mode} スキン 204 件'
    ],
    description: ['osu!・catch the beat・mania・taiko 用スキンが {amount} 件見つかりました'],
    0: 'すべて',
    1: '一番人気',
    2: 'osu!',
    3: 'ctb',
    4: 'mania',
    5: 'taiko',
    6: 'ユニバーサル比',
    7: '何も見つかりませんでした',
    8: 'このカテゴリのスキンは見つかりませんでした',
    9: [
      'ダウンロード数',
      '閲覧数',
      'いいね数'
    ],
    10: '投稿されたスキン',
    11: '現在キューに入っているスキン：{amount} 件',
    12: '現在、審査待ちのスキンはありません'
  },
  skin: {
    title: [
      '新しいスキンを投稿',
      '{name} の osu スキン'
    ],
    description: '{modes} 用の {size}MB の osu スキン。制作者：{creators}。対応アスペクト比：{ratios}',
    rules: {
      0: `無意味な投稿を**しないでください**`,
      1: `**著しくクオリティが低かったり**、**重複したスキン**の投稿はお控えください`,
      2: `投稿するスキンが**すでに公開されているものでないこと**をご確認ください`,
      3: `**cpol**および**osuck**に投稿された動画内で使用されている、もしくは**トップランカーが使用していること**が確認できるスキンは**削除から保護されます**。`,
      4: `スクリーンショットはスキンに関連するものであり、なおかつ正確に描画されているものを使用してください。`,
      5: `元の作成者が**非公開にしたもの**や、**共有されることを望まない**スキンを、許可なくアップロードしないでください。`,
      6: `If **your skin** is based on someone else's work or **uses assets** from other creators, **credit them** in your post.`,
      7: `If your skin **includes** third-party assets (art, hitsounds, fonts, etc.), you **must** have permission and provide proper **credit** in the **Resources** tab of your submission.`,
      8: `All submissions **must use English** as the primary language.\n- Titles containing **non-Latin** characters must also **include a Romanized** version.`,
      9: `**Prohibited** content includes:\n- Religious or political content\n- Racism, hate speech, or harassment\n- Offensive or discriminatory imagery\n- Excessive gore or extreme violence\n- Explicit sexual content, including depictions of minors.`,
      10: `Suggestive or borderline content **must be clearly labeled** with the **NSFW** tag.`
    },
    0: 'すべてクリアしますか？',
    1: '投稿する',
    2: '投稿ルール',
    3: '同意して投稿',
    4: '変更案を提案',
    5: 'スキンを更新',
    6: 'スキンを評価するにはログインしてください',
    7: '提案された変更',
    8: '適用したい変更を選んでください',
    9: '適用',
    10: '却下',
    11: '変更を適用',
    12: [
      '概要',
      'スクリーンショット',
      'リソース',
      'ダウンロード数',
      'コメント'
    ],
    13: 'バナーを追加しました',
    14: 'バナーを更新しました',
    15: 'スクリーンショットの合計サイズは 100 MB を超えないようにしてください（現在 {amount}）',
    16: 'バリアント：{name}',
    17: 'このリンクのリソースはすでに追加されています',
    18: `このリンクは使用できません。YouTubeリンクをご利用ください。`,
    19: 'この動画はすでに追加されています',
    20: 'このタグはすでに追加されています',
    21: '権限がありません',
    22: 'アカウントにログインしてください',
    23: `このリンクは使用できません。MEGA、Googleドライブ、もしくはMediaFireのリンクをご利用ください。`,
    24: 'この osu! フォーラムリンクには対応していません',
    25: 'この Reddit リンクには対応していません',
    26: 'リンクを解析できませんでした',
    27: 'この Twitter リンクには対応していません',
    28: '不明なクラウドサービスです',
    29: 'バージョンを管理',
    30: '新しいバージョン',
    31: 'スキン名を入力',
    33: 'アスペクト比を選択',
    34: '{amount} 件の問題',
    35: '編集',
    36: 'スキンを報告するにはログインしてください',
    37: '編集を終了',
    38: 'バナーを削除',
    39: '説明',
    40: '**アニメーション** - アニメーション付きの要素（戻るボタン / スキップボタン / HP バーなど）があります',
    41: '**エクストラ** - カスタマイズ用や追加ゲームプレイ用のファイルがあります',
    42: '**HD** - 解像度 1366x768 より **上** 向けのファイルがあります',
    43: '**SD** - 解像度 1366x768 より **下** 向けのファイルがあります',
    44: 'リリース日：{date}',
    45: 'アップロード日：{date}',
    46: 'YouTube 動画のリンクを貼り付け',
    47: 'クイック選択',
    48: 'スクリーンショットをすべて削除しますか？',
    49: 'バリアント名を入力…',
    50: 'スクリーンショットカテゴリを選択',
    51: 'バージョンを比較',
    52: 'ゲームプレイのみ表示',
    53: '説明と URL を「説明:url」の形式で入力してください',
    54: '説明：',
    55: 'URL：',
    56: `おっと！`,
    57: 'このスキンには `.osk` ファイルが添付されていません',
    58: `何も見つかりませんでした`,
    59: 'キーワードを変えるか、別の条件で検索してみてください',
    60: 'ファイルを報告するにはログインしてください',
    61: 'バージョン',
    62: 'ダウンロードリンク',
    63: 'osu! フォーラムリンク',
    64: 'Reddit リンク',
    65: 'Twitter リンク',
    66: '制作者',
    67: '制作者が匿名を希望している場合や、共同制作者が Bancho アカウントを持っていない場合は、ゴースト制作者として追加できます。',
    68: '制作者が追加されていません',
    69: 'タグ',
    70: 'タグが追加されていません',
    71: '入力し始めると候補が表示されます',
    72: '表示',
    73: [
      '作成者',
      'ミキサー',
      'アニメーション',
      'アート',
      'コラボ',
      '効果音',
      'ゲームプレイ'
    ],
    74: '全ての変更をローカルに保存しました',
    75: 'キャッシュから変更を復元しました',
    76: 'リリース日：{date}',
    77: 'ロールを選択',
    78: '問題を報告する',
    79: 'HPバー/戻るボタン/スキップアニメーションが無いバージョン',
    80: 'プレイ画面のみのバージョン',
    81: 'Files for customization / additional gameplay elements (and unused files)',
    82: 'Select rating',
    83: 'Released at:',
    checks: {
      0: 'スキン名が指定されていません',
      1: '最低でも1人は作成者を追加してください',
      2: '最低でも1つはアスペクト比を選択してください',
      3: 'スクリーンショットがありません',
      4: '最低でも1つはゲームプレイ中のスクリーンショットを追加してください',
      5: 'スキンのリンクが指定されていません',
      6: '一部の作成者にロールがありません',
      7: '一部の作成者に名前がありません',
      8: 'スキンのリリース日が指定されていません',
      9: 'スキンのバージョンが指定されていません',
      10: 'コンテンツレーティングが選択されていません'
    }
  },
  skin_block: {
    0: 'スキンページを開く',
    1: 'フルスクリーンで開く',
    2: '別のゲームモードに切り替え',
    3: '画像カテゴリを変更',
    4: '短縮リンクをコピー'
  },
  gallery: {
    0: 'フルスクリーンで開く',
    1: 'フルスクリーンを終了',
    2: 'ズームをリセット',
    3: 'ギャラリーを閉じる'
  },
  screenshots_select: {
    0: 'ようこそ',
    1: 'メインメニュー',
    2: '楽曲選択',
    3: 'モードメニュー',
    4: 'MOD',
    5: 'カウントダウン',
    6: 'ゲームプレイ',
    7: 'スピナー',
    8: 'セクションパス',
    9: 'セクションフェイル',
    10: 'ポーズ画面',
    11: '失敗画面',
    12: 'リザルト画面（上部）',
    13: 'スキップ',
    14: 'バナー',
    15: 'リザルト画面（下部）',
    16: 'ピン留め画像',
    17: 'osu!',
    18: 'catch the beat',
    19: 'mania',
    20: 'taiko'
  },
  report: {
    skin_ini: [
      '不具合の内容と、できれば再現手順も教えてください',
      '実装してほしいこと・改善してほしいことを教えてください…'
    ],
    tag: {
      0: '足りないスキン',
      1: '足りないスキンの動画リンク'
    },
    skin_file: [
      'ダウンロードリンクがありません',
      'スキンが壊れています',
      'どのように壊れているか詳しく教えてください'
    ],
    skin: [
      'スクリーンショットの誤り・不足',
      'どのスクリーンショットが足りないか',
      '制作者情報の誤り・不足',
      'テキストを入力してください…',
      'NSFW タグが付いていない',
      'メタデータ',
      'どこが問題なのか詳しく書いてください',
      '著作権 / クレジットの問題',
      'テキストを入力してください…'
    ],
    0: '問題を報告するにはログインしてください',
    1: '種類が選択されていません',
    2: `IDが存在しません`,
    3: 'カテゴリが選択されていません',
    4: 'この報告はすでに送信されています',
    5: '報告を送信しました',
    6: '報告のカテゴリを選択',
    7: '報告を送信'
  },
  plural: {
    skins: '{amount} skin | {amount} skins | {amount} skins',
    tags_skins: '«{name}» {amount} skin | «{name}» {amount} skins | «{name}» {amount} skins',
    views: '{amount} view | {amount} views | {amount} views',
    votes: '{amount} vote | {amount} votes | {amount} votes'
  },
  placeholder: {
    0: 'テキストを入力..',
    1: 'リンクを入力..',
    2: 'hex / rgb カラーを入力..'
  },
  sorting: {
    date: '日付',
    release_date: 'リリース日',
    upload_date: 'アップロード日',
    view: '閲覧数',
    vote: '投票数',
    name: '名前',
    download: 'ダウンロード数',
    like: 'いいね',
    size: 'サイズ',
    total: '合計'
  },
  order: {
    0: '多い順 | 少ない順',
    1: '多い順 | 少ない順',
    2: '高い順 | 低い順',
    3: '大きい順 | 小さい順',
    4: '新しい順 | 古い順',
    5: 'A-Z | Z-A'
  },
  tooltips: {
    0: [
      '[hl]{example}[/hl] - {amount} と[b]同じ[/b]',
      '[hl]{example}[/hl] - {amount} より[b]大きい[/b]',
      '[hl]{example}[/hl] - {amount} より[b]小さい[/b]',
      '[hl]{example}[/hl] - {amount} と {amount_2} の[b]間[/b]'
    ],
    1: '使い方の例：',
    2: `スクリーンショットカテゴリを選択`,
    3: '{amount} 回ダウンロード',
    4: '{amount} 回閲覧',
    5: '{likes} 件のいいね / {dislikes} 件の低評価',
    6: '{amount} 個のスキン',
    7: '{amount} 票'
  },
  nsfw: {
    0: 'NSFW 警告！',
    1: 'このスキンにはセンシティブまたは成人向けの内容が含まれます！',
    2: 'Warning!',
    3: 'ケモノ注意！'
  },
  drag: {
    0: 'クリックして画像を追加',
    1: 'またはここにドラッグ＆ドロップ',
    2: `画像をここにドロップ`
  },
  buttons: {
    source: 'イラストの出典',
    load_more: 'もっと見る',
    close: '閉じる',
    choose: [
      'はい',
      'いいえ'
    ],
    expand_more: 'もっと見る | 閉じる'
  },
  error: {
    0: 'ホームページ',
    1: 'ログイン',
    2: '問題を報告'
  }
};