export default {
  header: {
    home: 'Главная',
    contests: 'Конкурсы',
    ideas: 'Хочу идеи',
    tools: 'Инструменты',
    popular: 'Популярные скины',
    all_skins: 'Все скины',
    tags: 'Теги',
    new: 'Новый',
    contribute: 'Помочь с переводом',
    login: 'Войти',
    0: 'Просмотры',
    1: 'Скачивания',
    2: 'Лайки'
  },
  notifications: {
    0: 'Уведомления',
    1: 'На этих платформах вы можете получать уведомления о новых скинах'
  },
  user_menu: {
    0: 'профиль',
    1: 'очередь моих скинов',
    2: 'заново войти',
    3: 'выйти'
  },
  status: {
    0: 'Ничего не найдено',
    1: 'Не найдено',
    2: `Не удалось загрузить изображение`,
    3: 'Нет изображения для загрузки'
  },
  settings: {
    0: 'Настройки',
    1: 'Прокрутка мышью',
    2: 'Позволяет легко навигации по изображению при наведении на блок скина.',
    3: 'Масштаб',
    4: 'Включает автоматическое масштабирование изображения при наведении на блок скина.'
  },
  footer: { 0: 'Источники' },
  home: {
    title: [
      'Скины для osu!',
      'Рандомные osu! скины'
    ],
    description: 'Получите лучшие скины osu! на нашем сайте! В нашей огромной библиотеке есть скины для всех игровых режимов, соотношений сторон и даже для лучших игроков. Кроме того, у нас есть специальный раздел для поклонников аниме. Улучшите свой игровой процесс с помощью идеального скина. #osuskins #osugame #anime',
    0: 'Доступные для загрузки',
    1: 'Самые [viewed], [liked], [downloaded] скины',
    2: [
      'просматриваемые',
      'понравившиеся',
      'скачиваемые'
    ],
    3: [
      'Новые',
      'Новые релизы',
      'Рандомные'
    ],
    4: 'соотношение сторон',
    5: 'больше'
  },
  credits: {
    title: [
      'Использованные арты',
      'Использованные ресурсы',
      'Помогли с локализацией'
    ],
    0: 'Источники',
    1: 'Кто-нибудь? [{lang}]',
    2: 'Похоже, что cyperdark забыл их добавить. {text}',
    3: [
      'Арты',
      'Локализация',
      'Ресурсы'
    ],
    4: 'Все иконки взяты с {name}',
    5: 'Все изображения флагов взяты из {name}'
  },
  tools: {
    title: 'Инструменты скиннинга для osu! (от меня :) )',
    description: 'Полезные инструменты для скининга, созданные cyperdark\'ом',
    0: 'Больше инструментов для скиннинга'
  },
  skin_ini: {
    title: 'Визуальный редактор для skin.ini - osu! tools',
    description: '',
    prepare: [
      'загрузка карты',
      'загрузка скина',
      'подготовка скина',
      'загрузка плеера'
    ],
    0: 'Добро пожаловать в визуальный редактор skin.ini!',
    1: 'Здесь вы можете посмотреть изменениями вашего скина в реальном времени, такие как цвета комбо, цвета слайдеров и смещение шрифтов. Пока что только для osu! std',
    2: 'Карта:',
    3: 'Вставить ссылку на карту',
    4: 'Импорт .osk / .zip',
    5: 'Импортировать папку',
    6: '.osu файл не найден',
    7: 'На данный момент поддерживается только osu! гейммод',
    8: 'Skin.ini не найден',
    9: 'Выберите хотя бы 1 .osk / .zip файл',
    10: 'Настройки плеера',
    11: 'Сбросить skin.ini',
    12: 'Экспорт skin.ini',
    13: 'Рандомизировать цвета (на текущей вкладке)',
    14: 'Переход по вкладкам',
    15: 'Перемотка назад',
    16: 'Перемотка вперёд',
    17: 'Воспроизведение/Пауза',
    18: 'Перейти в предыдущий раздел настроек',
    19: 'Перейти в следующий раздел настроек',
    20: 'Открыть меню',
    21: 'Закрыть меню',
    22: 'Кнопки',
    23: 'Описание',
    24: 'Укажите через запятую',
    25: 'Рандомизировать',
    26: 'Восстановить элемент по умолчанию',
    27: 'Сбросить всё',
    28: 'Заменить файл',
    29: 'проблема',
    30: 'Перетащите файлы или скин',
    31: 'загружено',
    32: 'Скорость воспроизведения',
    33: 'Случайная карта',
    34: 'Выберите папку карты'
  },
  contests: {
    title: 'Оффициальные конкурсы скинов',
    description: 'Список всех действующих/завершенных конкурсов',
    submit: [
      'увы, больше не принимают заявки :(',
      'Принимают заявки...',
      'Отправить заявку'
    ],
    0: 'Официальные конкурсы скинов',
    1: [
      'Приём',
      'Подготовка',
      'Голосование',
      'Завершено'
    ],
    2: 'Объявление',
    3: 'Приём завершён',
    4: 'Голосование началось',
    5: 'Голосование закончилось',
    6: 'Результаты опубликованы',
    7: 'Подача заявок...',
    8: 'Подготовка...',
    9: 'Голосование...',
    10: 'Ожидание результатов...',
    11: 'Голосовать тута',
    12: 'объявление',
    13: 'заявки',
    14: 'страница конкурса',
    15: 'результаты',
    16: 'вики',
    17: 'Завершится через',
    18: 'Скины не найдены для этого конкурса',
    19: 'Раскрыть описание | Закрыть описание'
  },
  ideas: {
    title: 'Вдохновение - osu! skins',
    description: 'На нашем сайте вы найдете вдохновение для создания своего следующего osu! скина Просмотрите разнообразную коллекцию скинов и откройте для себя новые техники и идеи. Вдохновляйтесь и создавайте свои собственные уникальные скины.',
    0: 'Скриншоты для этой категории не найдены'
  },
  search: {
    title: 'Поиск osu! скинов',
    description: 'Найдите идеальный osu! скин с помощью нашей функции расширенного поиска. Просмотрите нашу огромную библиотеку, отфильтрованную по игровому режиму, соотношению сторон и т. д. Или посмотрите скины, используемые лучшими игроками.',
    0: 'Название скина, имя автора или тег',
    1: [
      'название',
      'теги',
      'авторы'
    ],
    2: 'Выберите диапазон дат',
    3: 'Диапазон веса',
    4: 'Диапазон количества просмотров',
    5: 'Диапазон количества скачиваний',
    6: 'Диапазон количества лайков',
    7: 'Выберите тип курсора',
    8: 'Ничего не найдено',
    9: 'Попробуйте использовать другой набор фильтров поиска',
    10: 'В ожидание',
    11: 'Используйте фильтры поиска или введите название, имя автора или теги',
    12: 'Select mania key',
    13: 'сбросить',
    14: 'Цвет курсора',
    15: 'Цвет круга',
    16: 'Цвет границ слайдера',
    17: 'Цвет слайдера',
    18: 'экспериментальные фильтры'
  },
  tags: {
    title: 'Поиск тегов',
    description: '',
    0: 'Ничего не найдено',
    1: 'Попробуйте найти что-то другое'
  },
  tag: {
    title: '{name} osu! skins',
    description: '',
    0: 'Ничего не найдено',
    1: 'Не найдено скинов для этого тега',
    2: 'Попробуйте изменить гейммод'
  },
  users: {
    title: [
      'Профиль - {name} публикации',
      'Профиль - {name} скины'
    ],
    description: [
      'Все osu! cкины загруженные {name}',
      'Все osu! скины созданные {name}'
    ],
    0: [
      'Созданные скины',
      'Загруженные скины'
    ],
    1: 'Неправильный адрес',
    2: 'Убедитесь, что указана правильная ссылка. Пример: {url}',
    3: 'Неподдерживаемый формат',
    4: 'Неверный формат ссылки, используйте {url} или {url_1}',
    5: `Измените хотя бы что-то перед обновлением`,
    6: `Невозможно обновить настройки`,
    7: `Настройки обновлены`,
    8: 'Неизвестная ошибка',
    9: 'Настройки',
    10: 'Никнейм дискорда',
    11: 'Ссылка на дискорд сервер',
    12: 'Ссылка на твиттер',
    13: 'Ссылка на профиль реддита',
    14: 'Ссылка на ютуб канал',
    15: 'Ссылка на блог',
    16: 'Показывать ваши понравившиеся скины',
    17: 'Обновить настройки',
    18: '{amount} постов | {amount} постов | {amount} постов',
    19: 'Блог',
    20: 'Статистика скинов',
    21: 'Раскрыть «о себе» | Закрыть «о себе»',
    22: 'Ничего не найдено',
    23: 'Не найдено скинов для этого автора'
  },
  skins: {
    title: [
      '{amount} osu! скинов',
      '{amount} {category} osu! скинов',
      '{amount} osu! скинов под любое соотношение сторон',
      '204 Самых просматриваемых {mode} скинов',
      '204 Самых скачиваемых {mode} скинов',
      '204 Самых лайкнутых {mode} скинов'
    ],
    description: ['{amount} скинов для osu!, catch the beat, mania и taiko'],
    0: 'Все',
    1: 'Популярные',
    2: 'osu!',
    3: 'ctb',
    4: 'mania',
    5: 'taiko',
    6: 'универсальное соотношение',
    7: 'Ничего не найдено',
    8: 'Не найдено скинов для этой категории',
    9: [
      'скачивания',
      'просмотры',
      'лайки'
    ],
    10: 'Скины на модерации',
    11: 'Скинов в очереди: {amount}',
    12: 'Нету скинов'
  },
  skin: {
    title: [
      'Добавить новый скин',
      '{name} osu! скины'
    ],
    description: '{size}MB osu скин для {modes}, созданный {creators}. Поддерживает {ratios}',
    rules: {
      0: `**Не присылайте** бред.`,
      1: `**Не** присылайте **низкокачественные** или **дубликаты** посты.`,
      2: `Убедитесь, что ваш скин **не** был уже **опубликован**.`,
      3: `Скин **защищён от удаления**, если он был показан в видео таких каналов, как **cpol и osuck**, или если **топ-игрок** использовал его в публичном контенте (Twitch, YouTube, Twitter, TikTok, GitHub, и т. д)`,
      4: `Скриншоты должны быть **релевантными** и **точно представлять** скин.`,
      5: `**Не загружайте приватные** скины или скины которые автор пожелал **не постить**. (Если у вас нет разрешения)`,
      6: `Если **ваш скин** основан на чужой работе или **использует элементы** из других скинов, **укажите ссылки** на них в ресурсах.`,
      7: `Если в вашем скине **присутствуют** сторонние материалы (арты, хитсаунды, шрифты, и т. д.), вы **должны** получить разрешение и правильно **подписать автора** во вкладке **Ресурсы** вашей публикации.`,
      8: `Все посты **должны быть на английском языке** как основной язык.\n- Названия содержащие **не латинские** символы должны **иметь романизированную** версию.`,
      9: `**Запрещённый** контент включает:\n- Религиозный или политический материал\n- Расизм, пропаганда ненависти, или домогательство\n- Оскорбительные или дискриминитивные изображения\n- Чрезмерную жестокость или экстремальное насилие\n- Явный сексуальный контент, включая изображения несовершеннолетних.`,
      10: `Неприличный или крайне соблазнительный материал **должен быть ясно** помечен тегом **NSFW**.`
    },
    0: 'Сбросить все?',
    1: 'Отправить',
    2: 'Правила публикации',
    3: 'Принять и отправить',
    4: 'Предложить изменения',
    5: 'Обновить скин',
    6: 'Войдите, чтобы оценить скин',
    7: 'Предложенные изменения',
    8: 'Выберите, какие изменения вы хотите применить',
    9: 'Применить',
    10: 'Отказать',
    11: 'Применить изменения',
    12: [
      'О скине',
      'Скриншоты',
      'Ресурсы',
      'Скачивания',
      'Комментарии'
    ],
    13: 'Баннер добавлен',
    14: 'Баннер обновлен',
    15: 'Общий размер всех скриншотов не должен превышать 100 МБ (сейчас {amount})',
    16: 'Вариант: {name}',
    17: 'Ресурс с этой ссылкой уже был добавлен',
    18: `Ссылка не поддерживается. Разрешены только ссылки с ютуба.`,
    19: 'Видео уже добавлено',
    20: 'Тег уже добавлен',
    21: 'Неавторизован',
    22: 'Войти в аккаунт',
    23: `Ссылка не поддерживается. Разрешены только ссылки MEGA, Google Drive и MediaFire.`,
    24: 'Неподдерживаемая ссылка на osu! форум',
    25: 'Неподдерживаемая ссылка на реддит',
    26: 'Не удалось обработать ссылку',
    27: 'Неподдерживаемая ссылка на твиттер',
    28: 'Неизвестный облачный сервис',
    29: 'Управление версиями',
    30: 'новая версия',
    31: 'Введите название скина',
    32: 'Есть дополнения?',
    33: 'Выберите соотношение сторон',
    34: '{amount} проблем',
    35: 'Редактировать',
    36: 'Войдите чтобы репортнуть скин',
    37: 'Выйти из редактирования',
    38: 'Удалить баннер',
    39: 'Описание',
    40: '**Анимации** — анимированные элементы (кнопка "Назад/кнопка "пропустить" / полоска хп)',
    41: '**Дополнения** - есть файлы для настройки / дополнительные игровые элементы',
    42: '**HD** — имеет файлы для разрешения **выше** 1366x768',
    43: '**SD** — имеет файлы для разрешения **ниже** 1366x768',
    44: 'Выпущено {date}',
    45: 'Загружено {date}',
    46: 'Вставьте ссылку на ютуб видео',
    47: 'Быстрый выбор',
    48: 'Удалить все скриншоты?',
    49: 'Ввести имя варианта...',
    50: 'Выберите категорию скриншота',
    51: 'Сравнить версии',
    52: 'Показать только геймплей',
    53: 'Введите описание и ссылку. Пример: описание:ссылка',
    54: 'Описание:',
    55: 'Ссылка:',
    56: `Ой!`,
    57: 'Нет прикрепленных к этому скину файлов `.osk`',
    58: `Ничего не найдено`,
    59: 'Измените запрос или попробуйте найти что-то другое',
    60: 'Войдите, чтобы зарепортить файл',
    61: 'Версии',
    62: 'Ссылка на скачаивания',
    63: 'ссылка на osu! форум',
    64: 'Ссылка на реддит',
    65: 'Ссылка на твиттер',
    66: 'Авторы',
    67: 'Если автор хочет быть анонимным или у соавтора нет аккаунта Bancho, вы можете добавить их в качестве призрачного создателя.',
    68: 'Авторы не добавлены',
    69: 'Теги',
    70: 'Теги не найдены',
    71: 'начните ввод для получения подсказок',
    72: 'Показать',
    73: [
      'Автор',
      'Миксер',
      'Анимации',
      'Арты',
      'Коллаб',
      'Звуки',
      'Геймплей'
    ],
    74: 'Все изменения сохранены локально',
    75: 'Изменения восстановлены из кэша',
    76: 'Выпущен {date}',
    77: 'Выберите роли',
    checks: {
      0: 'Не указано название скина',
      1: 'Добавьте хотя бы одного создателя скина',
      2: 'Выберите хотя бы одно соотношение сторон',
      3: 'Скриншоты не предоставлены',
      4: 'Добавьте хотя бы один скриншот геймплея',
      5: 'Не указана ссылка на скин',
      6: 'Некоторые создатели не имеют ролей',
      7: 'Некоторые создатели без имен',
      8: 'Не указана дата релиза скина',
      9: 'Не указана версия скина',
      10: 'Рейтинг контента не выбран'
    }
  },
  skin_block: {
    0: 'Открыть страницу скина',
    1: 'Открыть во весь экран',
    2: 'Переключиться на другой гейммод',
    3: 'Измените категорию изображения',
    4: 'Скопировать короткую ссылку'
  },
  gallery: {
    0: 'Открыть во весь экран',
    1: 'Выйти из полноэкранного режима',
    2: 'Сбросить масштаб',
    3: 'Закрыть галерею'
  },
  screenshots_select: {
    0: 'Экран приветствия',
    1: 'Главное меню',
    2: 'Экран выбора карт',
    3: 'Меню гейммодов',
    4: 'Моды',
    5: 'Обратный отсчет',
    6: 'Геймплей',
    7: 'Спиннер',
    8: 'Пасс секция',
    9: 'Фейл секция',
    10: 'Меню паузы',
    11: 'Меню фейла',
    12: 'Экран результата (верхняя часть)',
    13: 'Пропуск интро',
    14: 'Баннер',
    15: 'Экран результата (нижняя часть)',
    16: 'Закреплённое изображение',
    17: 'osu!',
    18: 'catch the beat',
    19: 'mania',
    20: 'taiko'
  },
  report: {
    skin_ini: [
      'Опишите баг, предпочтительно с шагами воспроизведения',
      'Опишите то, что вы хотите видеть...'
    ],
    tag: {
      0: 'Отсутствует скин',
      1: 'Ссылка на видео отсутствующего скина'
    },
    skin_file: [
      'Ссылка для скачивания отсутствует',
      'Скин неисправен',
      'Опишите, что именно не так'
    ],
    skin: [
      'Неправильные/отсутствующие скриншоты',
      'Какие скриншоты отсутствуют',
      'Неправильные/отсутствующие авторы',
      'Введите текст...',
      'Отсутствует NSFW тег',
      'Метаданные',
      'Опишите, что именно не так',
      'Авторские права/Отсутствующее указание автора',
      'Введите текст...'
    ],
    0: 'Войдите, чтобы зарепортить ошибку',
    1: 'Не выбран тип',
    2: `Id не существует`,
    3: 'Категория не выбрана',
    4: 'Репорт уже отправлен',
    5: 'Репорт отправлен',
    6: 'Выберите категорию репорта',
    7: 'Отправить репорт'
  },
  plural: {
    skins: '{amount} скин | {amount} скина | {amount} скинов',
    tags_skins: '«{name}» {amount} скин | «{name}» {amount} скина | «{name}» {amount} скинов',
    views: '{amount} просмотр | {amount} просмотра | {amount} просмотров',
    votes: '{amount} голоса | {amount} голос | {amount} голосов'
  },
  placeholder: {
    0: 'Введите текст..',
    1: 'Введите ссылку..',
    2: 'Введите цвет, hex или rgb...'
  },
  sorting: {
    date: 'Дата',
    release_date: 'Дата релиза',
    upload_date: 'Дата загрузки',
    view: 'Просмотры',
    vote: 'Голоса',
    name: 'Название',
    download: 'Скачивания',
    like: 'Лайки',
    size: 'Вес',
    total: 'Всего'
  },
  order: {
    0: 'Наиболее | Наименее',
    1: 'Наиболее | Наименее',
    2: 'От большего | К меньшему',
    3: 'Наибольший | Наименьший',
    4: 'Новые | Старые',
    5: 'А-Я | Я-А'
  },
  tooltips: {
    0: [
      '[hl]{example}[/hl] - [b]равен[/b] {amount}',
      '[hl]{example}[/hl] - [b]больше[/b] {amount}',
      '[hl]{example}[/hl] - [b]меньше[/b] {amount}',
      '[hl]{example}[/hl] - [b]от[/b] {amount} [b]до[/b] {amount_2}'
    ],
    1: 'Примеры использования:',
    2: `Выберите категорию скриншота`,
    3: '{amount} скачиваний',
    4: '{amount} просмотров',
    5: 'лайки: {likes} / дизлайки: {dislikes}',
    6: '{amount} скинов',
    7: '{amount} голосов'
  },
  nsfw: {
    0: 'Осторожно NSFW!',
    1: 'Этот скин содержит чувствительный или взрослый контент!',
    3: 'ОСТОРОЖНО ФУРРИ!'
  },
  drag: {
    0: 'Нажмите чтобы добавить изображение',
    1: 'или перетащите изображения сюда',
    2: `Отпускай`
  },
  buttons: {
    source: 'Источник арта',
    load_more: 'Загрузить больше',
    close: 'Закрыть',
    choose: [
      'Да',
      'Нет'
    ],
    expand_more: 'Показать больше | Показать меньше'
  },
  error: {
    0: 'домашняя страница',
    1: 'войти',
    2: 'Сообщить об ошибке'
  }
};