export default {
  hello: 'Вітання',
  title: {
    home: 'Головна',
    page: 'сторінка',
    guest: 'Ввійти',
    lists: { 0: 'Списки' },
    tags: {
      0: 'Теги',
      1: 'В категорії {name} є {amount} тегів'
    },
    ideas: {
      0: 'Натхнення',
      1: '«{amount}»'
    },
    sounds: { 0: 'Звуки' },
    leaderboard: { 0: 'Таблиці Лідерів' },
    extend: { 0: 'Розгорнути | Згорнути' },
    skin: {
      0: 'Цей скін містить елементи з інших скінів',
      1: 'Натисни для отримання інформації'
    }
  },
  changelogs: {
    0: 'Список змін',
    1: 'Перелік усіх змін, зроблених у поточній версії',
    2: 'Тут пусто',
    3: 'Але ти можеш додати зміни, зроблені в цій версії',
    4: 'Не згруповано',
    5: 'Нове',
    6: 'Виправлення',
    7: 'Зміни',
    8: 'Видалено'
  },
  creators: {
    0: 'Творці',
    1: 'Перелічи всіх творців долучених до створення цієї версії',
    2: 'Тут нікого',
    3: 'Під час пошуку за іменем гравця відобразиться список профілів.',
    4: 'Редактор',
    5: 'Ролі',
    6: 'Версії'
  },
  tags: {
    0: 'Теги',
    1: 'Список усіх тегів, пов’язаних із цим скіном',
    2: 'Тут досить порожньо.',
    3: 'Використовуй поле вище, щоб знайти нові теги'
  },
  videos: {
    0: 'Відео',
    1: 'Список усіх відеооглядів цього скіна',
    2: 'Оглядів нема',
    3: 'Спробуй знайти щось на YouTube або створи власний огляд'
  },
  sources: {
    0: 'Список ресурсів',
    1: 'Список усіх використаних елементів або інструментів у версії скіна',
    2: 'Тут якось порожньо',
    3: 'Якщо ти використовуєш елементи з артів або інших скінів, обов’язково додай посилання на них у поле вище',
    4: 'Не згруповано'
  },
  checks: {
    0: 'Всі',
    1: 'Метадані',
    2: 'Показати',
    4: 'Додай щонайменш одного творця',
    5: 'Додай кілька тегів',
    6: 'Не вказано вагу скіна',
    7: 'Обери хоча б один режим гри',
    8: 'Обери тип файлів (SD або HD)',
    9: 'Вибери принаймні одне співвідношення сторін',
    10: 'Жодного знімку екрану не завантажено',
    11: 'Додай принаймні один знімок геймплею',
    12: 'Не вказано посилання на скін',
    20: 'Непогано',
    21: 'Кожна проблема була виправлена. Добре зроблено',
    22: 'Контрольний перелік'
  },
  skins: {
    0: 'Скіни',
    1: 'Популярні',
    2: 'std | ctb',
    3: 'mania | taiko',
    4: 'Нові',
    5: 'Випадкові',
    6: 'Всі скіни',
    7: 'Пропорції',
    8: 'Всі скіни | osu skins',
    9: 'Скін | Скіни | Скінів',
    10: 'Скіни від {name} | Всі скіни від {name}',
    11: 'Пошук'
  },
  skin: {
    0: 'Редагувати',
    1: 'Додатково',
    2: 'HD',
    3: 'FullHD',
    4: 'Анімація',
    5: 'Знімки екрану',
    6: 'Тільки геймплей',
    7: 'Посилання для завантаження | Завантажити скін',
    8: 'Пост на форумі | Форум osu!',
    9: 'Пост на Reddit',
    10: 'Творці',
    11: 'Теги',
    13: 'Відео',
    14: 'Нова версія | Керувати версіями',
    15: 'Оновити | Надіслати',
    16: 'Режими гри',
    17: 'Назва скіна',
    18: 'Версія | Версії',
    19: 'Розмір',
    20: 'Метадані',
    21: 'Рейтинг',
    22: 'Завантаження',
    23: 'Завантаження буде доступне найближчим часом',
    24: 'Залишилось {amount} секунд',
    25: 'Ти не один з нас',
    26: 'Схоже, ви не є автором або редактором цього скіна'
  },
  drag: {
    0: 'Натисніть тут',
    1: 'або перетягніть зображення сюди'
  },
  footer: {
    0: 'Зроблено cyperdark',
    1: 'Credits'
  },
  credits: {
    0: 'Chibi',
    1: 'Малюнки',
    2: 'Іконки',
    3: 'Всі іконки беруться з {name}',
    4: 'Прапори',
    5: 'Всі зображення прапорів беруться з {name}',
    6: 'Локалізація',
    7: 'Хтось? [{lang}]',
    8: 'Схоже, cpol забув їх додати. {text}'
  },
  search: {
    0: 'Пошук скіну',
    1: 'Перегляди',
    2: 'Назва',
    3: 'Рейтинг',
    4: 'Розмір',
    5: 'Дата',
    7: 'Нічого не знайдено',
    8: 'Спробуйте налаштувати інші фільтри пошуку',
    9: 'Очікується запит',
    10: 'Виберіть пошукові фільтри або просто напишіть назву скіну, автора або тег'
  },
  tabs: {
    0: 'Пошук',
    1: 'Редагувати',
    2: 'Перелік'
  },
  undefined: {
    0: 'Порожньо',
    1: 'На жаль, тут нічого немає, але ви можете поглянути інші сторінки',
    2: 'На жаль, тут нічого немає',
    3: 'Неавторизовано',
    4: 'Ви повинні увійти в систему, щоб редагувати цей скін.',
    5: 'Ви повинні увійти в систему, щоб додати новий скін.'
  },
  meta: {
    title: {
      0: 'Домашня сторінка',
      1: 'Ігрові режими, співвідношення сторін osu, скіни',
      2: 'Популярні скіни osu',
      3: 'Пошук скінів osu',
      4: 'Список тегів, {name}',
      5: 'Скін {name} v{version} osu',
      6: 'Credits',
      7: 'Скіни osu',
      8: '{name} пошук скінів osu',
      9: 'Get inspiration from other osu skins',
      10: '{name} створив скіни osu'
    },
    description: {
      // 0: 'Get the best osu skins at our site, with a huge library to choose from! We have skins for different gamemodes and aspect ratios, and even feature top players and anime themes. Boost your gameplay with our high-quality skins.',
      0: 'Отримайте найкращі osu! скіни на нашому сайті! У нашій величезній бібліотеці є скіни для усіх режимів гри, співвідношення сторін і навіть кращих гравців. До того ж, у нас є спеціальний розділ для аніме шанувальників. Покращуйте свою гру з ідеальним скіном. #osuskins #osugame #anime',
      1: '{views} Переглядів. Розмір скіну для {modes} дорівнює\n {size} створений {creators}. Підтримує {ratios}',
      2: 'Знайдіть ідеальний osu! скін з нашою розширеною функцією пошуку. Переглядайте нашу величезну бібліотеку, відфільтровану через режими гри, співвідношення сторін і багато іншого. Або перегляньте скіни, які використовуються найкращими гравцями.',
      3: 'Відкрийте для себе різноманітні скіни для різних режимів гри та співвідношень сторін на нашому сайті. Вибирайте зі стандарту, ctb, mania та taiko режимів. Знайдіть ідеальний скін для вашого стилю гри.',
      4: 'Find the perfect osu skin from top players on our site. Browse our collection of popular skins and customize your gameplay. Discover a wide range of styles and themes to suit your preferences.',
      5: 'List of existing tags for osu skins.',
      6: '{name} osu skins collection!, free downloading',
      7: 'A huge amount of osu skins for {name}, download for free!',
      8: 'All osu skins created by {name}',
      9: 'Find inspiration for your next osu! skin at our site. Browse through a diverse collection of skins and discover new techniques and ideas. Get inspired and create your own unique skins.'
    },
    keywords: { 0: 'osu, osu!, osu скіни, std скіни, ctb скіни, mania скіни, taiko скіни, mrekk osu скіни,Rafis osu скіни,FlyingTuna osu скіни,Vaxei osu скіни,Cookiezi osu скіни,Varvalian osu скіни,RyuK osu скіни,WhiteCat osu скіни,_RyuK osu скіни,BeasttrollMC osu скіни,Genshin Impact osu скіни,Mathi osu скіни,WubWoofWolf osu скіни,Merami osu скіни,xootynator osu скіни,Gayzmcgee osu скіни,[Karcher] osu скіни,Bubbleman osu скіни,ChomikBox osu скіни,NSFW osu скіни,Lifeline osu скіни,Hatsune Miku osu скіни,Azerite osu скіни,Umbre osu скіни,404 AimNotFound osu скіни,-Nikstrim osu скіни,bloo osu скіни,Shigetora osu скіни,Badeu osu скіни,FunOrange osu скіни,worst hr player osu скіни,Tekkito osu скіни,ninerik osu скіни,azr8 osu скіни,idke osu скіни,Andros osu скіни,Zylice osu скіни,Rektygon osu скіни,Komori osu скіни,anime osu скіни,cyperdark osu скіни,Red_Pixel osu скіни,Utami osu скіни,Arknights osu скіни,Karthy osu скіни,Paraqeet osu скіни,aetrna osu скіни,Spare osu скіни,-GN osu скіни,Mastasz osu скіни,Seouless osu скіни,haga1115 osu скіни,shimon osu скіни,fieryrage osu скіни,Ekoro osu скіни,Firebat92 osu скіни,_Shield osu скіни,-Roaz- osu скіни,- Dark - osu скіни,atturbo555 osu скіни,Aristia osu скіни,_Aiko__ osu скіни,z x c osu скіни,eternum osu скіни,talala osu скіни,NyanPotato osu скіни,Arnold24x24 osu скіни,Alumetri osu скіни,im a fancy lad osu скіни,jordanlr7 osu скіни,Woey osu скіни,khz osu скіни,rrtyui osu скіни,kieg osu скіни,Rupertion osu скіни,FGSky osu скіни,Aireu osu скіни,Neko God osu скіни,Apostol osu скіни,Abyssal osu скіни,dokidokilolixx osu скіни,Mlaw osu скіни,Ponytail osu скіни,Reedkatt osu скіни,Zestiny osu скіни,Apraxia osu скіни,Binfy osu скіни,Rohulk osu скіни,-PloX osu скіни,DuyKhang-sama osu скіни,BronyPH osu скіни,Intercambing osu скіни,Xeltol osu скіни,Valorant osu скіни,Akolibed osu скіни,hololive osu скіни,kablaze osu скіни,tokyo ghoul osu скіни,Trail Mix osu скіни,Dereban osu скіни' }
  },
  buttons: {
    0: 'Увійти',
    1: 'Домашня сторінка',
    profile_osu: 'Профіль osu!',
    new_skin: 'Новий скін',
    notifications: 'Сповіщення',
    settings: 'Налаштування',
    logout: 'Вийти',
    load_more: 'Завантажити більше',
    copy_short: 'Копіювати посилання',
    copied: 'Скопійовано',
    reddit_link: 'Reddit',
    osu_forum_link: 'Форум osu!',
    skin_return: 'Назад до скіна'
  },
  user: {
    roles: {
      0: 'Розробник',
      1: 'Міксер',
      2: 'Анімації',
      3: 'Малюнки',
      4: 'Колаб'
    }
  },
  tooltips: {
    0: '{amount} переглядів',
    1: 'Оновити результати',
    2: 'За спаданням | За зростанням',
    3: '{amount} лайків',
    4: 'Натисніть ctrl+enter, щоб додати тег',
    5: 'Редагувати версію',
    6: '{s}Увійдіть{p}, щоб мати можливість оцінити цей скін',
    7: 'Немає опису',
    8: 'Немає URL'
  },
  lists: {
    screens: {
      0: 'Екран привітання',
      1: 'Головне меню',
      2: 'Екран вибору мап',
      3: 'Меню режимів',
      4: 'Модифікації',
      5: 'Меню зворотного відліку',
      6: 'Ігролад',
      7: 'Спінер',
      8: 'Section Pass',
      9: 'Section Fail',
      10: 'Екран паузи',
      11: 'Екран поразки',
      12: 'Екран результату',
      13: 'Пропустити',
      14: 'Банер'
    },
    cats: {
      0: 'NSFW',
      1: 'Furry',
      2: 'Mixed'
    }
  },
  select: {
    0: 'Нове',
    1: 'Виправлено',
    2: 'Змінено',
    3: 'Видалено',
    4: 'Арт',
    5: 'Шрифт',
    6: 'Автор',
    7: 'Елемент скіна',
    8: 'Аудіо/Ефекти',
    9: 'Інструменти',
    views: 'Перегляди',
    likes: 'Вподобайки',
    size_range: 'Розмір скіна',
    date_range: 'Діапазон дат',
    ratio: 'Співвідношення сторін | співвідношення'
  },
  placeholders: {
    0: 'Виберіть ролі',
    1: 'Виберіть версії',
    2: 'Введіть текст...',
    3: 'Розмір скіна',
    4: 'Діапазон дат',
    5: 'Рік',
    6: 'Місяць',
    7: 'Виберіть співвідношення сторін',
    8: 'Вибрати категорії',
    9: 'Режими гри',
    10: 'Виберіть тип',
    11: 'Вставте посилання на YouTube',
    12: 'Введіть опис і посилання. Приклад опису: посилання',
    13: 'Вибрати додатково',
    14: 'Вставити посилання',
    15: 'Назва скіна, ім\'я автора або тег'
  }
};