export default {
  header: {
    home: 'Головна',
    contests: 'Конкурси',
    ideas: 'Натхнення',
    tools: 'Tools',
    popular: 'Популярні скіни',
    all_skins: 'Всі скіни',
    tags: 'Теги',
    new: 'Новий',
    contribute: 'Зробити свій внесок',
    login: 'Увійти',
    0: 'Перегляди',
    1: 'Завантажень',
    2: 'Лайки'
  },
  notifications: {
    0: 'Сповіщення',
    1: 'Слідкуйте за нами на цих платформах, щоб отримувати сповіщення про нові скіни'
  },
  user_menu: {
    0: 'профіль',
    1: 'моя черга скінів',
    2: 'перезайти',
    3: 'вийти'
  },
  status: {
    0: 'Нічого не знайдено',
    1: 'Не знайдено',
    2: `Не вдалося завантажити зображення`,
    3: 'Немає зображень'
  },
  settings: {
    0: 'Налаштування',
    1: 'Прокрутка мишею',
    2: 'Дозволяє легку навігацію зображеннями при наведенні на блок скіна.',
    3: 'Приблизити',
    4: 'Дозволяє автоматичне масштабування зображень при наведенні курсором на блок скіна.'
  },
  footer: { 0: 'Внески' },
  home: {
    title: [
      'Осу скіни',
      'Рандомні осу скіни'
    ],
    description: 'Отримайте найкращі osu! скіни на нашому сайті! У нашій величезній бібліотеці є скіни для усіх режимів гри, співвідношень сторін екрану і навіть скіни усіх топ гравців. До того ж, у нас є спеціальний розділ для фанатів аніме. Покращіть свою гру з ідеальним для вас скіном. #osuskins #osugame #anime',
    0: 'Доступно для завантаження',
    1: 'Найбільш [viewed], [liked], [downloaded] скіни',
    2: [
      'Переглянуті',
      'Вподобані',
      'Завантажені'
    ],
    3: [
      'Нові',
      'Нові релізи',
      'Випадкові'
    ],
    4: 'Співвідношення сторін екрану',
    5: 'Більше'
  },
  credits: {
    title: [
      'Автори Ілюстрацій',
      'Використані джерела',
      'Допомогли з локалізацією'
    ],
    0: 'Внески',
    1: 'Хто-небудь? [{lang}]',
    2: 'Схоже, cyperdark забув їх додати. {text}',
    3: [
      'Ілюстрації',
      'Локалізація',
      'Список ресурсів'
    ],
    4: 'Всі іконки взято з {name}',
    5: 'Всі зображення прапорів взято з {name}'
  },
  tools: {
    title: 'Інструменти для створення osu! скінів  (від мене :) )',
    description: 'Корисні інструменти для створення скінів зроблені cyperdark\'ом',
    0: 'Більше інструментів для створення скінів'
  },
  skin_ini: {
    title: 'Візуальний редактор skin.ini - osu! tools',
    description: '',
    prepare: [
      'Завантаження карти',
      'Завантаження скіна',
      'Підготовка скіна',
      'Завантаження переглядача'
    ],
    0: 'Вітаємо у візувальному редакторі файлу skin.ini!',
    1: 'Тут ви можете змінити кольори комбо та слайдерів, а також шрифти та їх згладжування. Усі зміни відображатимуться у реальному часі. Наразі підтримується лише osu!standart',
    2: 'Бітмапа:',
    3: 'Вставити посилання на бітмапу',
    4: 'Імпортувати .osk / .zip',
    5: 'Імпортувати папку з скіном',
    6: 'Файл .osu не знайдено',
    7: 'Цей режим не підтримується. Наразі підтримується лише osu!standart',
    8: 'Skin.ini не знайдено',
    9: 'Виберіть щонайменше 1 .osk / .zip файл',
    10: 'Налаштування переглядача',
    11: 'Відновити skin.ini за замовчуванням',
    12: 'Експортувати skin.ini',
    13: 'Згенерувати випадкові кольори',
    14: 'Перехід по вкладкам',
    15: 'Перемотати назад',
    16: 'Перемотати вперед',
    17: 'Відтворити/Пауза',
    18: 'Перейти до попередньої секції налаштувань',
    19: 'Перейти до наступної секції налаштувань',
    20: 'Відкрити меню',
    21: 'Закрити меню',
    22: 'Гарячі клавіші',
    23: 'Опис',
    24: 'Вкажіть значення через кому',
    25: 'Вибрати навмання',
    26: 'Відновити елемент за замовчуванням',
    27: 'Скинути все до заводських налаштувань',
    28: 'Замінити файл',
    29: 'проблема',
    30: 'Перетягніть файл або скін',
    31: 'завантажено',
    32: 'Швидкість відтворення',
    33: 'Випадкова бітмапа',
    34: 'Папка бітмапи'
  },
  contests: {
    title: 'Офіційні конкурси скінів',
    description: 'Список всіх активних/завершених конкурсів',
    submit: [
      'Заявки більше не приймаються...',
      'Прийняття заявок відкрито...',
      'Надіслати заявку'
    ],
    0: 'Офіційні конкурси скінів',
    1: [
      'Прийняття ',
      'Підготовка',
      'Голосування',
      'Завершено'
    ],
    2: 'Оголошення',
    3: 'Прийняття закінчено',
    4: 'Голосування почалося',
    5: 'Голосування завершено',
    6: 'Результати опубліковано',
    7: 'Етап подачі заявок...',
    8: 'Eтап підготовки...',
    9: 'Eтап голосування...',
    10: 'Очікування результатів...',
    11: 'Голосувати тут',
    12: 'оголошення',
    13: 'заявки',
    14: 'сторінка конкурсу',
    15: 'результати',
    16: 'вікі',
    17: 'Закінчиться через',
    18: 'Скінів для цього конкурсу не знайдено ',
    19: 'Розгорнути опис | Згорнути опис'
  },
  ideas: {
    title: 'Натхнення - osu! скіни',
    description: 'Знайдіть натхнення для вашого нового osu! скіна на нашому сайті. Перегляньте різноманітну колекцію скінів та відкрийте для себе нові техніки й ідеї Отримуйте натхнення та створюйте свої унікальні скіни.',
    0: 'Знімки екрана для цієї категорії не знайдено'
  },
  search: {
    title: 'Пошук osu! скінів',
    description: 'Знайдіть ваш ідеальний osu! скін з допомогою розширеної функції пошуку. Перегляньте нашу величезну бібліотеку, відфільтровану за режими гри, співвідношенням сторін та іншими параметрами. Або перегляньте скіни топ плеєрів.',
    0: 'Назва скіна, ім\'я автора або тег',
    1: [
      'назва',
      'Теги',
      'Творці'
    ],
    2: 'Виберіть діапазон дат',
    3: 'Діапазон розмірів',
    4: 'Діапазон кількості переглядів',
    5: 'Діапазон кількості завантажень',
    6: 'Діапазон кількості лайків',
    7: 'Виберіть тип курсора',
    8: 'Нічого не знайдено',
    9: 'Спробуйте використати інший набір фільтрів пошуку',
    10: 'Запит у стані очікування',
    11: 'Скористайтеся пошуковими фільтрами або введіть назву скіна, ім\'я автора або один чи більше тегів',
    12: 'Select mania key',
    13: 'Скинути',
    14: 'Колір курсора',
    15: 'Колір кола',
    16: 'Колір меж слайдера',
    17: 'Колір середини слайдера',
    18: 'Експериментальні фільтри'
  },
  tags: {
    title: 'Пошук тегів',
    description: '',
    0: 'Нічого не знайдено',
    1: 'Спробуйте пошукати щось інше'
  },
  tag: {
    title: '{name} osu! skins',
    description: '',
    0: 'Нічого не знайдено',
    1: 'Не знайдено жодного скіна з цим тегом',
    2: 'Спробуйте змінити режим гри',
    3: 'missing skin'
  },
  users: {
    title: [
      'Профіль - {name} публікації',
      'Профіль - {name} скіни'
    ],
    description: [
      'Усі osu! скіни, завантажені {name}',
      'Усі osu! скіни, створені {name}'
    ],
    0: [
      'Створені скіни',
      'Завантажені скіни'
    ],
    1: 'Неправильна URL-адреса',
    2: 'Перевірте чи посилання вказано правильно. Приклад: {url}',
    3: 'Формат не підтримується',
    4: 'Невірний формат посилання, використовуйте {url} або {url_1}',
    5: `Змініть принаймні один параметр, перш ніж оновлювати`,
    6: `Неможливо оновити налаштування`,
    7: `Налаштування оновлено `,
    8: 'Невідома помилка',
    9: 'Налаштування',
    10: 'Discord нік',
    11: 'Посилання на Discord сервер ',
    12: 'Посилання на Twitter профіль',
    13: 'Посилання на Reddit профіль',
    14: 'Посилання на YouTube канал ',
    15: 'Посилання на блог ',
    16: 'Показувати ваші вподобані скіни',
    17: 'Оновити налаштування',
    18: '{amount} постів | {amount} постів | {amount} постів ',
    19: 'Блог',
    20: 'Статистика скінів',
    21: 'Розгорнути «про мене» | Згорнути «про мене»',
    22: 'Нічого не знайдено',
    23: 'Не знайдено жодного скіна цього автора'
  },
  skins: {
    title: [
      '{amount} osu! скінів',
      '{amount} {category} osu! скінів',
      '{amount} osu! скінів що підходять для будь-якого співвідношення сторін екрана',
      '204 найпопулярніших {mode} скінів ',
      '204 найбльш завантажених {mode} скінів ',
      '204 найбльш вподобаних {mode} скінів '
    ],
    description: ['{amount} скінів для osu!, catch the beat, mania і taiko'],
    0: 'Всі',
    1: 'Популярні',
    2: 'osu!',
    3: 'ctb',
    4: 'mania',
    5: 'taiko',
    6: 'універсальне співвідношення',
    7: 'Нічого не знайдено',
    8: 'В цій категорії немає жодного скіна',
    9: [
      'завантаження',
      'перегляди',
      'лайки'
    ],
    10: 'Надіслані скіни',
    11: 'Скінів зараз в черзі: {amount}',
    12: 'На даний момент немає скінів'
  },
  skin: {
    title: [
      'Опублікувати новий скін',
      '{name} osu! скіни'
    ],
    description: '{size}MB osu! скін для {modes}, створений {creators}. Підтримує {ratios}',
    rules: {
      0: `**Не** постіть нісенітниці.`,
      1: `**Не** публікуйте **низькоякісних** постів та дублікатів.`,
      2: `Переконайтеся, що ваш скін **не опублікували** до вас.`,
      3: `Скін **захищено від видалення**, якщо він з'являвся у відео на каналах **cpol та osuck**, або у публічному контенті одного з **топ-гравців**. (Twitch, YouTube, Twitter, TikTok, GitHub тощо)`,
      4: `Знімки екрану повинні бути **доречними** і **точно представляти** скін.`,
      5: `**Не** завантажуйте скінів які автор позначив як **приватні** або які він не бажає оприлюднювати. (Хіба що вам дали дозвіл)`,
      6: `Якщо **ваш скін** базований на чужій роботі або **містить елементи** від інших авторів, **додайте посилання** на них до свого посту.`,
      7: `Якщо ваш скін **включає** елементи інших авторів ви **повинні** мати дозвіл на їх використання та **акредитувати** авторів у вкладці **Ресурси** вашого поста.`,
      8: `Всі пости **повинні бути написані здебільшого англійською**.\n
Назви, що містять **не латинські** символи повинні також мати **романізовану версію**.`,
      9: `**Заборонений** контент включає в себе:\n- Релігійно або політично забарвлений матеріал\n- Расизм, хейтспіч або домагання\n- Образливі або дискримінуючі ілюстрації\n - Надмірну жорстокість або насилля\n- Контент сексуального характеру, особливо якщо він містить зображення неповнолітніх.`,
      10: `Контент із сексуальним підтекстом або контент "на межі з нормою", **повинен бути чітко позначений** за допомогою **NSFW** тега.`
    },
    0: 'Очистити все?',
    1: 'Надіслати',
    2: 'Правила подання',
    3: 'Прийняти і відправити',
    4: 'Запропонувати зміни',
    5: 'Оновити скін',
    6: 'Увійдіть, щоб оцінити скін',
    7: 'Пропоновані зміни',
    8: 'Виберіть, які зміни ви хочете застосувати',
    9: 'Застосувати',
    10: 'Відхилити',
    11: 'Застосувати зміни',
    12: [
      'Про скін',
      'Знімки екрану',
      'Ресурси',
      'Завантажень',
      'Коментарі'
    ],
    13: 'Банер додано',
    14: 'Банер оновлено',
    15: 'Загальний розмір всіх скріншотів не повинен перевищувати 100 МБ (наразі {amount})',
    16: 'Варіант: {name}',
    17: 'Ресурс з цим посиланням вже додано',
    18: `Підтримуються лише посилання на YouTube.`,
    19: 'Відео вже додано',
    20: 'Тег вже додано',
    21: 'Не авторизовано',
    22: 'Увійти в обліковий запис',
    23: `Посилання не підтримується. Дозволено лише посилання на MEGA, Google Drive та MediaFire.`,
    24: 'Непідтримуване посилання на форум osu!',
    25: 'Непідтримуване посилання на reddit',
    26: 'Не вдалося розпізнати посилання',
    27: 'Непідтримуване посилання на Twitter',
    28: 'Невідома хмарна служба',
    29: 'Керування версіями',
    30: 'Нова версія',
    31: 'Введіть назву скіна',
    32: 'Містить додаткові елементи?',
    33: 'Виберіть співвідношення сторін екрану',
    34: '{amount} проблем',
    35: 'Редагувати',
    36: 'Увійдіть, щоб надіслати скаргу про скін',
    37: 'Завершити редагування',
    38: 'Видалити банер',
    39: 'Опис',
    40: '**Анімації** - має анімовані елементи (кнопка "Назад" / кнопка "Skip" / шкала hp)',
    41: '**Екстра** - має файли для персоналізації / додаткові ігрові елементи',
    42: '**HD** - містить файли для роздільної здатності **вище** ніж 1366x768',
    43: '**SD** - містить файли для роздільної здатності **нижче** ніж 1366x768',
    44: 'Випущено {date}',
    45: 'Завантажено {date}',
    46: 'Вставтe посилання на YouTube відео',
    47: 'Швидкий вибір',
    48: 'Видалити всі знімки екрана?',
    49: 'Введіть назву варіанту...',
    50: 'Виберіть категорію знімку екрана',
    51: 'Порівняти версії',
    52: 'Показати лише геймплей',
    53: 'Введіть опис та посилання. Приклад: опис:посилання',
    54: 'Опис:',
    55: 'Посилання:',
    56: `Ой!`,
    57: 'До цього скіну не прикріплено жодного .osk файлу',
    58: `Нічого не знайдено`,
    59: 'Змініть запит або спробуйте знайти щось інше',
    60: 'Увійдіть, щоб надіслати скаргу про файл',
    61: 'Версії',
    62: 'Посилання для завантаження',
    63: 'Посилання на osu! форум',
    64: 'Посилання на Reddit',
    65: 'Посилання на Twitter',
    66: 'Автори',
    67: 'Якщо автор хоче залишитися анонімним або якщо у співавтор немає акаунта на bancho (osu! акаунта). Ви можете додати його як "творця привида".',
    68: 'Авторів не додано',
    69: 'Теги',
    70: 'Тегів не додано',
    71: 'почніть писати щоб отримати пропозиції',
    72: 'Показати',
    73: [
      'Автор',
      'Міксер',
      'Анімації',
      'Ілюстрації',
      'Колаборація',
      'Звуки',
      'Геймплей'
    ],
    74: 'Всі зміни збережено локально',
    75: 'Зміни відновлено з кешу',
    76: 'Випущений {date}',
    77: 'Виберіть ролі',
    78: 'report issue',
    79: 'Version without hp bar, back button and skip animations',
    80: 'Gameplay only version',
    81: 'Files for customization / additional gameplay elements (and unused files)',
    checks: {
      0: 'Назву скіна не вказано',
      1: 'Додайте хоча б одного автора',
      2: 'Виберіть принаймні одне співвідношення сторін екрану',
      3: 'Знімків екрану не надано',
      4: 'Додайте хоча б один скріншот геймплея',
      5: 'Посилання на скін не вказано',
      6: 'Деякі автори не мають ролей',
      7: 'Деякі автори не мають імен',
      8: 'Дата випуску скіна не вказана',
      9: 'Версію скіна не вказано ',
      10: 'Рейтинг контенту не вибрано'
    }
  },
  skin_block: {
    0: 'Відкрити сторінку скіна',
    1: 'Відкрити у повноекранному режимі',
    2: 'Перейти на інший ігровий режим',
    3: 'Змінити категорію зображень',
    4: 'Копіювати коротке посилання'
  },
  gallery: {
    0: 'Відкрити у повноекранному режимі',
    1: 'Вийти з повноекранного режиму',
    2: 'Скинути масштаб',
    3: 'Закрити галерею'
  },
  screenshots_select: {
    0: 'Екран привітання',
    1: 'Головне меню',
    2: 'Екран вибору бітмап',
    3: 'Меню вибору ігрових режимів',
    4: 'Моди',
    5: 'Зворотній відлік',
    6: 'Геймплей',
    7: 'Спінер',
    8: 'Section Pass',
    9: 'Section Fail',
    10: 'Екран паузи',
    11: 'Fail екран',
    12: 'Екран результатів (верхня частина)',
    13: 'Пропустити інтро',
    14: 'Банер',
    15: 'Екран результатів (нижня частина)',
    16: 'Закріплене зображення',
    17: 'osu!',
    18: 'catch the beat',
    19: 'mania',
    20: 'taiko'
  },
  report: {
    skin_ini: [
      'Опишіть помилку, бажано з кроками відтворення',
      'Опишіть те, що ви хочете побачити...'
    ],
    tag: {
      0: 'Скін відсутній',
      1: 'Посилання веде на відео про скін якого немає'
    },
    skin_file: [
      'Посилання для завантаження відсутнє',
      'Скін поламаний ',
      'Опишіть, що саме не працює'
    ],
    skin: [
      'Знімки екрану неправильні/відсутні',
      'Які саме скріншоти відсутні',
      'Автори відсутні або вказані неправильно',
      'Введіть текст...',
      'Відсутній NSFW тег',
      'Метадані',
      'Опишіть, що саме не правильно',
      'Авторське право / Автора не вказано',
      'Введіть текст...'
    ],
    0: 'Увійдіть, щоб повідомити про проблему',
    1: 'Тип не вибрано',
    2: `Id не існує`,
    3: 'Категорію не вибрано',
    4: 'Скаргу вже надіслано',
    5: 'Скаргу надіслано',
    6: 'Оберіть категорію скарги',
    7: 'Надіслати скаргу'
  },
  plural: {
    skins: '{amount} скін | {amount} скіна | {amount} скінів',
    tags_skins: '«{name}» {amount} скін | «{name}» {amount} скіна | «{name}» {amount} скінів',
    views: '{amount} перегляд | {amount} перегляди | {amount} переглядів',
    votes: '{amount} голос | {amount} голоси | {amount} голосів'
  },
  placeholder: {
    0: 'Введіть текст..',
    1: 'Введіть посилання..',
    2: 'Введіть hex/rgb колір..'
  },
  sorting: {
    date: 'Дата',
    release_date: 'Дата випуску',
    upload_date: 'Дата завантаження',
    view: 'Перегляди',
    vote: 'Голосів',
    name: 'Назва',
    download: 'Завантажень',
    like: 'Лайки',
    size: 'Розмір',
    total: 'Всього'
  },
  order: {
    0: 'Найбільш | Найменш',
    1: 'Найбільш | Найменш',
    2: 'Найвищі | Найнижчі',
    3: 'Найбільші | Найменші',
    4: 'Нові | Старі',
    5: 'А-Z | Z-А'
  },
  tooltips: {
    0: [
      '[hl]{example}[/hl] - [b]дорівнює[/b] {amount}',
      '[hl]{example}[/hl] - [b]більше ніж[/b] {amount}',
      '[hl]{example}[/hl] - [b]менше ніж[/b] {amount}',
      '[hl]{example}[/hl] - [b]між[/b] {amount} [b]та[/b] {amount_2}'
    ],
    1: 'Приклади використання:',
    2: `Виберіть категорію знімку екрана`,
    3: '{amount} завантажень',
    4: '{amount} переглядів',
    5: '{likes} лайків / {dislikes} дізлайків',
    6: '{amount} osu! скінів',
    7: '{amount} голосів'
  },
  nsfw: {
    0: 'Обережно попереду NSFW!',
    1: 'Цей скін містить делікатний контент або контент для дорослих!',
    3: 'Обережно попереду Фурі!'
  },
  drag: {
    0: 'Натисніть, щоб додати зображення',
    1: 'або перетягніть зображення сюди',
    2: `Відпустіть`
  },
  buttons: {
    source: 'Джерело ілюстрації',
    load_more: 'Завантажити більше',
    close: 'Закрити',
    choose: [
      'Так',
      'Ні'
    ],
    expand_more: 'Показати більше | Показати менше'
  },
  error: {
    0: 'Головна сторінка',
    1: 'увійти',
    2: 'Повідомити про проблему'
  }
};