export default {
  header: {
    home: '主页',
    contests: '比赛',
    ideas: '灵感',
    tools: '工具',
    popular: '热门皮肤',
    all_skins: '所有皮肤',
    tags: '标签',
    new: '最新',
    contribute: '贡献',
    login: '登录',
    0: '浏览',
    1: '下载',
    2: '点赞'
  },
  notifications: {
    0: '通知',
    1: '在这些平台上关注我们来接收关于新皮肤的通知'
  },
  user_menu: {
    0: '个人资料',
    1: '我的皮肤队列',
    2: '重新登录',
    3: '登出'
  },
  status: {
    0: '未找到结果',
    1: '未找到',
    2: `无法加载图片`,
    3: '没有图片可加载'
  },
  settings: {
    0: '设置',
    1: '鼠标滚轮操作',
    2: '当鼠标悬浮在皮肤封面上时启用便捷的图片翻页。',
    3: '放大',
    4: '当鼠标悬浮在皮肤封面上时自动缩放图片。'
  },
  footer: { 0: '致谢' },
  home: {
    title: [
      '发现 osu! 皮肤',
      '随机 osu! 皮肤'
    ],
    description: '在我们的网站上找到最佳 osu! 皮肤！我们有适用于所有游戏模式、宽高比甚至是顶尖玩家的皮肤，此外还有二次元专区。使用完美的皮肤，提升你的游戏体验。#osuskins #osugame #anime',
    0: '可下载',
    1: '[viewed] · [liked] · [downloaded]',
    2: [
      '最多浏览',
      '最多点赞',
      '最多下载'
    ],
    3: [
      '最新',
      '最新发布',
      '随机'
    ],
    4: '宽高比',
    5: '更多'
  },
  credits: {
    title: [
      '美术致谢',
      '使用资源',
      '本地化协助者'
    ],
    0: '致谢',
    1: '有人吗？[{lang}]',
    2: '似乎 cyperdark 忘记添加了。{text}',
    3: [
      '美术',
      '本地化',
      '资产'
    ],
    4: '所有图标都来自 {name}',
    5: '所有旗帜图像都来自 {name}'
  },
  tools: {
    title: 'osu! 皮肤制作工具（我做的 :) )',
    description: '由 cyperdark 制作的 osu! 皮肤创作实用工具',
    0: '更多皮肤工具'
  },
  skin_ini: {
    title: '可视化 skin.ini 编辑器 - osu! 工具',
    description: '',
    prepare: [
      '正在加载谱面',
      '正在加载皮肤',
      '正在准备皮肤',
      '正在加载查看器'
    ],
    0: '欢迎使用可视化 skin.ini 编辑器！',
    1: '您可以在此实时预览您的皮肤实机画面，如 combo 颜色、滑条颜色和字体偏移。目前只支持 std 模式',
    2: '谱面：',
    3: '粘贴谱面链接',
    4: '导入 .osk / .zip',
    5: '导入皮肤文件夹',
    6: '找不到 .osu 文件',
    7: '游戏模式不正确，只允许使用 osu 谱面',
    8: '找不到 skin.ini',
    9: '选择至少 1 个 .osk / .zip 文件',
    10: '查看器设置',
    11: '重置 skin.ini',
    12: '导出 skin.ini',
    13: '随机化颜色（当前选项卡）',
    14: '切换选项卡',
    15: '后退',
    16: '播放',
    17: '播放/暂停查看器',
    18: '移至设置的上一部分',
    19: '移至设置的下一部分',
    20: '打开菜单',
    21: '关闭菜单',
    22: '快捷键',
    23: '简介',
    24: '用逗号指定',
    25: '随机',
    26: '重置为默认元素',
    27: '重置为默认',
    28: '替换文件',
    29: '问题',
    30: '拖放文件或皮肤',
    31: '已加载',
    32: '游戏速度',
    33: '随机谱面',
    34: '谱面文件夹'
  },
  contests: {
    title: '官方 osu! 皮肤比赛',
    description: '所有进行中/已结束的 osu! 比赛列表',
    submit: [
      '投稿已结束...',
      '接受投稿中...',
      '我要投稿'
    ],
    0: '官方皮肤比赛',
    1: [
      '投稿',
      '准备中',
      '投票中',
      '已结束'
    ],
    2: '公告',
    3: '投稿截止',
    4: '投票开始',
    5: '投票结束',
    6: '结果公布',
    7: '投稿阶段...',
    8: '准备阶段...',
    9: '投票阶段...',
    10: '等待结果...',
    11: '在此投票',
    12: '公告',
    13: '投稿',
    14: '比赛页面',
    15: '结果',
    16: 'wiki',
    17: '还剩',
    18: '找不到这场比赛的皮肤',
    19: '展开描述 | 折叠描述'
  },
  ideas: {
    title: '灵感 - osu! 皮肤',
    description: '在我们的网站上为您的下一个 osu! 皮肤寻找灵感。浏览多样化的皮肤集合，发现新技巧和想法。受到启发并创建自己独特的皮肤。',
    0: '找不到此分类下的截图'
  },
  search: {
    title: '搜索 osu 皮肤',
    description: '使用我们高级的搜索功能找到完美的 osu! 皮肤。浏览我们庞大的库，按游戏模式，画面比例等进行筛选。或者，查看顶尖玩家使用的皮肤。',
    0: '皮肤标题、作者或标签',
    1: [
      '名称',
      '标签',
      '创作者'
    ],
    2: '选择日期范围',
    3: '文件大小范围',
    4: '浏览量范围',
    5: '下载量范围',
    6: '点赞量范围',
    7: '选择光标样式',
    8: '未找到结果',
    9: '试试更改搜索过滤规则吧',
    10: '待查询中',
    11: '使用搜索过滤器或键入皮肤名称/作者/标签',
    12: '选择 mania 键数',
    13: '重置',
    14: '光标颜色',
    15: '圆圈颜色',
    16: '滑条描边颜色',
    17: '滑条轨道颜色',
    18: '实验性过滤器'
  },
  tags: {
    title: '搜索标签',
    description: '',
    0: '未找到结果',
    1: '试试搜索别的吧'
  },
  tag: {
    title: '{name} osu 皮肤',
    description: '',
    0: '未找到结果',
    1: '没有找到该标签下的皮肤',
    2: '试试换个游戏模式吧'
  },
  users: {
    title: [
      '个人资料 - {name} 上传的',
      '个人资料 - {name} 创作的'
    ],
    description: [
      '{name} 上传的所有 osu! 皮肤',
      '{name} 创作的所有 osu! 皮肤'
    ],
    0: [
      '创作的皮肤',
      '上传的皮肤'
    ],
    1: '网址不正确',
    2: '请确保网址输入准确无误。示例：{url}',
    3: '不支持的格式',
    4: '链接格式不正确，请使用 {url} 或 {url_1}',
    5: `请更改至少一个设置再更新`,
    6: `无法更新设置`,
    7: `设置更新成功`,
    8: '未知错误',
    9: '设置',
    10: 'Discord用户名',
    11: 'Discord服务器链接',
    12: 'Twitter个人主页链接',
    13: 'Reddit个人主页链接',
    14: 'YouTube频道链接',
    15: 'Blog链接',
    16: '展示赞过的皮肤',
    17: '更新设置',
    18: '{amount} 上传 | {amount} 上传 | {amount} 上传',
    19: '博客',
    20: '皮肤统计',
    21: '展开个人简介 | 折叠个人简介',
    22: '未找到结果',
    23: '没有找到该作者创作的皮肤'
  },
  skins: {
    title: [
      '{amount}个osu!皮肤',
      '{amount}个{category}皮肤',
      '{amount}个全宽高比皮肤',
      '204 最多浏览的 {mode} 皮肤',
      '204 最多下载的 {mode} 皮肤',
      '204 最多点赞的 {mode} 皮肤'
    ],
    description: ['{amount}个全模式皮肤'],
    0: '所有模式',
    1: '热门',
    2: 'osu!',
    3: 'ctb',
    4: 'mania',
    5: 'taiko',
    6: '全宽高比',
    7: '未找到结果',
    8: '没有找到该分类下的皮肤',
    9: [
      '次下载',
      '次浏览',
      '人点赞'
    ],
    10: '已提交的皮肤',
    11: '当前队列中的皮肤数量: {amount}',
    12: '没有审核中的皮肤'
  },
  skin: {
    title: [
      '投稿新皮肤',
      '“{name}” osu 皮肤'
    ],
    description: '{size}MB的 {modes} osu皮肤，作者 {creators}。支持 {ratios}',
    rules: {
      0: `**禁止**发布无意义内容。`,
      1: `**禁止**提交**低创**或**重复**投稿。`,
      2: `确保您提交的皮肤**尚未发布过**。`,
      3: `被 **cpol、osuck** 等频道视频收录或被**顶尖选手**在公开内容（Twitch/YouTube/Twitter/TikTok/GitHub 等平台）中**使用**的皮肤**受保护不被删除**`,
      4: `截图必须与**实际**皮肤**一致**。`,
      5: `**禁止**上传原作者设置为**私有**或不愿分享的皮肤（获得授权除外）`,
      6: `基于他人作品修改或**使用他人的素材**时必须在帖子中**标注原作者**。`,
      7: `如果你的皮肤**包含**非原创的资产(插画、打击音效)，你**必须**在**资源**选项卡下提供明确的致谢信息。`,
      8: `投稿主要语言**必须为英文**。\n- 含**非拉丁**字符的标题需**附加罗马化**版本。`,
      9: `禁止内容:\n- 宗教或政治内容\n- 种族主义、仇恨言论或骚扰\n- 冒犯/歧视性的图片\n- 过度血腥/暴力内容\n- 露骨色情内容, 包括对未成年人的描绘`,
      10: `性暗示或擦边内容**必须明确标注NSFW**标签。`
    },
    0: '要全部清除吗？',
    1: '提交',
    2: '投稿规则',
    3: '同意并提交',
    4: '对修改提出建议',
    5: '更新皮肤',
    6: '登录以评分',
    7: '建议的修改',
    8: '选择要应用的修改',
    9: '应用',
    10: '拒绝',
    11: '应用修改',
    12: [
      '简介',
      '截图',
      '素材',
      '下载',
      '评论'
    ],
    13: '横幅图片已添加',
    14: '横幅图片已更新',
    15: '截图文件总大小不能超过100MB(当前{amount})',
    16: '变种：{name}',
    17: '已添加过该资源链接',
    18: `不支持的链接。仅支持YouTube链接。`,
    19: '已添加过视频',
    20: '该标签已添加',
    21: '未授权',
    22: '登录到账号',
    23: `Link not supported. Only MEGA, Google Drive and MediaFire links are allowed.`,
    24: '不支持的osu!论坛链接',
    25: '不支持的reddit链接',
    26: '无法解析链接',
    27: '不支持的Twitter链接',
    28: '未知的云盘服务',
    29: '管理版本',
    30: '新建版本',
    31: '输入皮肤名称',
    32: '是否有额外组件?',
    33: '选择宽高比',
    34: '{amount} 个问题',
    35: '编辑',
    36: '登录以举报皮肤',
    37: '退出编辑',
    38: '移除横幅',
    39: '简介',
    40: '**动画** - 包含动画元素(返回键/跳过键/血条)',
    41: '**额外组件** - 包含用于自定义/额外游戏内元素的文件',
    42: '**高清** - 包含分辨率大于1366x768的贴图文件',
    43: '**标清** - 包含**小于或等于**1366x768的贴图文件',
    44: '发布日期: {date}',
    45: '更新日期: {date}',
    46: '将YouTube视频链接粘贴在此处',
    47: '快速选择',
    48: '移除所有截图?',
    49: '输入变种名称...',
    50: '选择截图分类',
    51: '对比版本',
    52: '只显示游戏内截图',
    53: '输入简介与链接。格式为 description:url',
    54: '简介:',
    55: '网址:',
    56: `出错了！`,
    57: '此皮肤没有附加`.osk`文件',
    58: `未找到结果`,
    59: '更改搜索条件或试试搜搜别的',
    60: '登录以举报文件',
    61: '版本',
    62: '下载链接',
    63: 'osu!论坛链接',
    64: 'Reddit链接',
    65: 'Twitter链接',
    66: '作者',
    67: '如果作者想要匿名/合作者没有官服账号，你可以添加幽灵账号以代表他们。',
    68: '未添加创作者',
    69: '标签',
    70: '未添加标签',
    71: '开始输入查看提示',
    72: '显示',
    73: [
      '创作者',
      '缝合者',
      '动画',
      '美术',
      '合作',
      '音效',
      '游戏内'
    ],
    74: '所有更改已保存到本地',
    75: '已从缓存中加载更改',
    76: '{date}发布',
    77: '选择分工',
    checks: {
      0: '未标明皮肤名称',
      1: '添加至少一个作者',
      2: '选择至少一个宽高比',
      3: '未提供截图',
      4: '添加至少一个游戏内截图',
      5: '未标明皮肤链接',
      6: '未注明部分作者分工',
      7: '未注明部分作者名称',
      8: '未注明皮肤发布日期',
      9: '未注明皮肤版本',
      10: '未选择内容分级'
    }
  },
  skin_block: {
    0: '打开皮肤页面',
    1: '全屏显示',
    2: '切换到其他游戏模式',
    3: '更改图片类别',
    4: '复制短链接'
  },
  gallery: {
    0: '全屏显示',
    1: '退出全屏',
    2: '重置缩放',
    3: '关闭图库'
  },
  screenshots_select: {
    0: '欢迎界面',
    1: '主菜单',
    2: '选歌界面',
    3: '模式菜单',
    4: '模组界面',
    5: '倒计时界面',
    6: '游戏内',
    7: '转盘',
    8: '分段通过界面',
    9: '分段未通过界面',
    10: '暂停界面',
    11: '游戏失败界面',
    12: '结算界面(上部)',
    13: '跳过界面',
    14: '横幅',
    15: '结算界面(下部)',
    16: '置顶图片',
    17: 'osu!',
    18: '接水果',
    19: 'mania',
    20: 'taiko'
  },
  report: {
    skin_ini: [
      '描述bug，最好包含复现步骤',
      '描述你想看到的东西...'
    ],
    tag: {
      0: '缺失皮肤',
      1: '缺失皮肤的视频链接'
    },
    skin_file: [
      '缺少下载链接',
      '皮肤损坏',
      '描述具体出错的地方'
    ],
    skin: [
      '错误/缺少截图',
      '缺少哪些截图',
      '错误/缺少创作者',
      '输入文本...',
      'NSFW标签缺失',
      '元数据',
      '描述具体出错的地方',
      '版权问题/缺少致谢',
      '输入文本...'
    ],
    0: '登录以反馈问题',
    1: '类型未选择',
    2: `ID不存在`,
    3: '未选择分类',
    4: '该举报已提交',
    5: '举报提交成功',
    6: '选择举报类型',
    7: '提交举报'
  },
  plural: {
    skins: '{amount} 个皮肤 | {amount} 个皮肤 | {amount} 个皮肤',
    tags_skins: '«{name}» {amount} 个皮肤 | «{name}» {amount} 个皮肤 | «{name}» {amount} 个皮肤',
    views: '{amount} 次浏览 | {amount} 次浏览 | {amount} 次浏览',
    votes: '{amount} 次投票 | {amount} 次投票 | {amount} 次投票'
  },
  placeholder: {
    0: '输入文本..',
    1: '输入链接...',
    2: '输入hex/rgb颜色代码..'
  },
  sorting: {
    date: '日期',
    release_date: '发布日期',
    upload_date: '上传日期',
    view: '浏览',
    vote: '投票数',
    name: '名称',
    download: '下载',
    like: '点赞',
    size: '大小',
    total: '总计'
  },
  order: {
    0: '最多 | 最少',
    1: '最多 | 最少',
    2: '最高 | 最低',
    3: '最大 | 最小',
    4: '最新 | 最旧',
    5: 'A-Z | Z-A'
  },
  tooltips: {
    0: [
      '[hl]{example}[/hl] - [b]等于[/b] {amount}',
      '[hl]{example}[/hl] - [b]大于[/b] {amount}',
      '[hl]{example}[/hl] - [b]小于[/b] {amount}',
      '[hl]{example}[/hl] - 在 {amount} [b]到[/b] {amount_2} [b]之间[/b]'
    ],
    1: '用法示例：',
    2: `选择截图分类`,
    3: '{amount} 次下载',
    4: '{amount} 次浏览',
    5: '{likes} 人点赞 / {dislikes} 人点踩',
    6: '{amount} 个皮肤',
    7: '{amount} 次投票'
  },
  nsfw: {
    0: 'NSFW 警告！',
    1: '此皮肤包含敏感或成人内容！',
    3: '福瑞警告！'
  },
  drag: {
    0: '点击添加图片',
    1: '或者拖放图像到这里',
    2: `拖拽图片到此处`
  },
  buttons: {
    source: '插画来源',
    load_more: '显示更多',
    close: '关闭',
    choose: [
      '是',
      '否'
    ],
    expand_more: '展开 | 折叠'
  },
  error: {
    0: '主页',
    1: '登录',
    2: '报告问题'
  }
};